Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>DMA1</name>
			<description>DMA1 controller</description>
			<groupName>DMA1</groupName>
			<baseAddress>0x40020000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>DMA1_CH1</name>
				<description>DMA1 Channel1 global interrupt</description>
				<value>57</value>
			</interrupt>
			<interrupt>
				<name>DMA1_CH2</name>
				<description>DMA1 Channel2 global interrupt</description>
				<value>38</value>
			</interrupt>
			<interrupt>
				<name>DMA1_CH3</name>
				<description>DMA1 Channel3 global interrupt</description>
				<value>39</value>
			</interrupt>
			<interrupt>
				<name>DMA1_CH4</name>
				<description>DMA1 Channel4 global interrupt</description>
				<value>40</value>
			</interrupt>
			<interrupt>
				<name>DMA1_CH5</name>
				<description>DMA1 Channel5 global interrupt</description>
				<value>41</value>
			</interrupt>
			<interrupt>
				<name>DMA1_CH6</name>
				<description>DMA1 Channel6 global interrupt</description>
				<value>42</value>
			</interrupt>
			<interrupt>
				<name>DMA1_CH7</name>
				<description>DMA1 Channel7 global interrupt</description>
				<value>43</value>
			</interrupt>
			<interrupt>
				<name>DMA1_CH8</name>
				<description>DMA1 Channel8 global interrupt</description>
				<value>44</value>
			</interrupt>
			<registers>
				<register>
					<name>INTFR</name>
					<displayName>INTFR</displayName>
					<description>DMA interrupt status register
          (DMA_INTFR)					</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>GIF1</name>
							<description>Channel 1 Global interrupt
              flag							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCIF1</name>
							<description>Channel 1 Transfer Complete
              flag							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTIF1</name>
							<description>Channel 1 Half Transfer Complete
              flag							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEIF1</name>
							<description>Channel 1 Transfer Error
              flag							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GIF2</name>
							<description>Channel 2 Global interrupt
              flag							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCIF2</name>
							<description>Channel 2 Transfer Complete
              flag							</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTIF2</name>
							<description>Channel 2 Half Transfer Complete
              flag							</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEIF2</name>
							<description>Channel 2 Transfer Error
              flag							</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GIF3</name>
							<description>Channel 3 Global interrupt
              flag							</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCIF3</name>
							<description>Channel 3 Transfer Complete
              flag							</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTIF3</name>
							<description>Channel 3 Half Transfer Complete
              flag							</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEIF3</name>
							<description>Channel 3 Transfer Error
              flag							</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GIF4</name>
							<description>Channel 4 Global interrupt
              flag							</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCIF4</name>
							<description>Channel 4 Transfer Complete
              flag							</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTIF4</name>
							<description>Channel 4 Half Transfer Complete
              flag							</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEIF4</name>
							<description>Channel 4 Transfer Error
              flag							</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GIF5</name>
							<description>Channel 5 Global interrupt
              flag							</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCIF5</name>
							<description>Channel 5 Transfer Complete
              flag							</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTIF5</name>
							<description>Channel 5 Half Transfer Complete
              flag							</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEIF5</name>
							<description>Channel 5 Transfer Error
              flag							</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GIF6</name>
							<description>Channel 6 Global interrupt
              flag							</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCIF6</name>
							<description>Channel 6 Transfer Complete
              flag							</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTIF6</name>
							<description>Channel 6 Half Transfer Complete
              flag							</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEIF6</name>
							<description>Channel 6 Transfer Error
              flag							</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GIF7</name>
							<description>Channel 7 Global interrupt
              flag							</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCIF7</name>
							<description>Channel 7 Transfer Complete
              flag							</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTIF7</name>
							<description>Channel 7 Half Transfer Complete
              flag							</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEIF7</name>
							<description>Channel 7 Transfer Error
              flag							</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GIF8</name>
							<description>Channel 8 Global interrupt
              flag							</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCIF8</name>
							<description>Channel 8 Transfer Complete
              flag							</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTIF8</name>
							<description>Channel 8 Half Transfer Complete
              flag							</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEIF8</name>
							<description>Channel 8 Transfer Error
              flag							</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>INTFCR</name>
					<displayName>INTFCR</displayName>
					<description>DMA interrupt flag clear register
          (DMA_INTFCR)					</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CGIF1</name>
							<description>Channel 1 Global interrupt
              clear							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CGIF2</name>
							<description>Channel 2 Global interrupt
              clear							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CGIF3</name>
							<description>Channel 3 Global interrupt
              clear							</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CGIF4</name>
							<description>Channel 4 Global interrupt
              clear							</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CGIF5</name>
							<description>Channel 5 Global interrupt
              clear							</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CGIF6</name>
							<description>Channel 6 Global interrupt
              clear							</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CGIF7</name>
							<description>Channel 7 Global interrupt
              clear							</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CGIF8</name>
							<description>Channel 8 Global interrupt
              clear							</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTCIF1</name>
							<description>Channel 1 Transfer Complete
              clear							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTCIF2</name>
							<description>Channel 2 Transfer Complete
              clear							</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTCIF3</name>
							<description>Channel 3 Transfer Complete
              clear							</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTCIF4</name>
							<description>Channel 4 Transfer Complete
              clear							</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTCIF5</name>
							<description>Channel 5 Transfer Complete
              clear							</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTCIF6</name>
							<description>Channel 6 Transfer Complete
              clear							</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTCIF7</name>
							<description>Channel 7 Transfer Complete
              clear							</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTCIF8</name>
							<description>Channel 8 Transfer Complete
              clear							</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHTIF1</name>
							<description>Channel 1 Half Transfer
              clear							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHTIF2</name>
							<description>Channel 2 Half Transfer
              clear							</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHTIF3</name>
							<description>Channel 3 Half Transfer
              clear							</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHTIF4</name>
							<description>Channel 4 Half Transfer
              clear							</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHTIF5</name>
							<description>Channel 5 Half Transfer
              clear							</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHTIF6</name>
							<description>Channel 6 Half Transfer
              clear							</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHTIF7</name>
							<description>Channel 7 Half Transfer
              clear							</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHTIF8</name>
							<description>Channel 8 Half Transfer
              clear							</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTEIF1</name>
							<description>Channel 1 Transfer Error
              clear							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTEIF2</name>
							<description>Channel 2 Transfer Error
              clear							</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTEIF3</name>
							<description>Channel 3 Transfer Error
              clear							</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTEIF4</name>
							<description>Channel 4 Transfer Error
              clear							</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTEIF5</name>
							<description>Channel 5 Transfer Error
              clear							</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTEIF6</name>
							<description>Channel 6 Transfer Error
              clear							</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTEIF7</name>
							<description>Channel 7 Transfer Error
              clear							</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTEIF8</name>
							<description>Channel 8 Transfer Error
              clear							</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGR1</name>
					<displayName>CFGR</displayName>
					<description>DMA channel configuration register
          (DMA_CFGR)					</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EN</name>
							<description>Channel enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCIE</name>
							<description>Transfer complete interrupt
              enable							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTIE</name>
							<description>Half Transfer interrupt
              enable							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEIE</name>
							<description>Transfer error interrupt
              enable							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DIR</name>
							<description>Data transfer direction</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CIRC</name>
							<description>Circular mode</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PINC</name>
							<description>Peripheral increment mode</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MINC</name>
							<description>Memory increment mode</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PSIZE</name>
							<description>Peripheral size</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MSIZE</name>
							<description>Memory size</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PL</name>
							<description>Channel Priority level</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MEM2MEM</name>
							<description>Memory to memory mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DOUBLE_MODE</name>
							<description>Double buffer mode enable bit</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLAG_CUR_MEM</name>
							<description>Memory address selection setting</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CNTR1</name>
					<displayName>CNTR</displayName>
					<description>DMA channel 1 number of data
          register					</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>NDT</name>
							<description>Number of data to transfer</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PADDR1</name>
					<displayName>PADDR1</displayName>
					<description>DMA channel 1 peripheral address
          register					</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PA</name>
							<description>Peripheral address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MADDR1</name>
					<displayName>MADDR1</displayName>
					<description>DMA channel 1 memory address
          register					</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MA</name>
							<description>Memory address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>M1ADDR1</name>
					<displayName>M1ADDR1</displayName>
					<description>DMA channel 1 memory address1
          register					</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>M1A</name>
							<description>Memory address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGR2</name>
					<displayName>CFGR2</displayName>
					<description>DMA channel configuration register
          (DMA_CFGR)					</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EN</name>
							<description>Channel enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCIE</name>
							<description>Transfer complete interrupt
              enable							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTIE</name>
							<description>Half Transfer interrupt
              enable							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEIE</name>
							<description>Transfer error interrupt
              enable							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DIR</name>
							<description>Data transfer direction</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CIRC</name>
							<description>Circular mode</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PINC</name>
							<description>Peripheral increment mode</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MINC</name>
							<description>Memory increment mode</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PSIZE</name>
							<description>Peripheral size</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MSIZE</name>
							<description>Memory size</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PL</name>
							<description>Channel Priority level</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MEM2MEM</name>
							<description>Memory to memory mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CNTR2</name>
					<displayName>CNTR2</displayName>
					<description>DMA channel 2 number of data
          register					</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>NDT</name>
							<description>Number of data to transfer</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PADDR2</name>
					<displayName>PADDR2</displayName>
					<description>DMA channel 2 peripheral address
          register					</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PA</name>
							<description>Peripheral address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
