Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup.svd
				<register>
					<name>CFGR8</name>
					<displayName>CFGR8</displayName>
					<description>DMA channel configuration register
          (DMA_CFGR)					</description>
					<addressOffset>0x94</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EN</name>
							<description>Channel enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCIE</name>
							<description>Transfer complete interrupt
              enable							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTIE</name>
							<description>Half Transfer interrupt
              enable							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEIE</name>
							<description>Transfer error interrupt
              enable							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DIR</name>
							<description>Data transfer direction</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CIRC</name>
							<description>Circular mode</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PINC</name>
							<description>Peripheral increment mode</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MINC</name>
							<description>Memory increment mode</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PSIZE</name>
							<description>Peripheral size</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MSIZE</name>
							<description>Memory size</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PL</name>
							<description>Channel Priority level</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MEM2MEM</name>
							<description>Memory to memory mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CNTR8</name>
					<displayName>CNTR8</displayName>
					<description>DMA channel 8 number of data
          register					</description>
					<addressOffset>0x98</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>NDT</name>
							<description>Number of data to transfer</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PADDR8</name>
					<displayName>PADDR8</displayName>
					<description>DMA channel 8 peripheral address
          register					</description>
					<addressOffset>0x9C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PA</name>
							<description>Peripheral address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MADDR8</name>
					<displayName>MADDR8</displayName>
					<description>DMA channel 8 memory address
          register					</description>
					<addressOffset>0xA0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MA</name>
							<description>Memory address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>M1ADDR8</name>
					<displayName>M1ADDR8</displayName>
					<description>DMA channel 8 memory address 2
          register					</description>
					<addressOffset>0xA4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>M1A</name>
							<description>Memory address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral derivedFrom="DMA1">
			<name>DMA2</name>
			<baseAddress>0x40020400</baseAddress>
			<interrupt>
				<name>DMA2_CH1</name>
				<description>DMA2 Channel1 global interrupt</description>
				<value>102</value>
			</interrupt>
			<interrupt>
				<name>DMA2_CH2</name>
				<description>DMA2 Channel2 global interrupt</description>
				<value>103</value>
			</interrupt>
			<interrupt>
				<name>DMA2_CH3</name>
				<description>DMA2 Channel3 global interrupt</description>
				<value>104</value>
			</interrupt>
			<interrupt>
				<name>DMA2_CH4</name>
				<description>DMA2 Channel4 global interrupt</description>
				<value>105</value>
			</interrupt>
			<interrupt>
				<name>DMA2_CH5</name>
				<description>DMA2 Channel5 global interrupt</description>
				<value>106</value>
			</interrupt>
			<interrupt>
				<name>DMA2_CH6</name>
				<description>DMA2 Channel6 global interrupt</description>
				<value>107</value>
			</interrupt>
			<interrupt>
				<name>DMA2_CH7</name>
				<description>DMA2 Channel7 global interrupt</description>
				<value>108</value>
			</interrupt>
			<interrupt>
				<name>DMA2_CH8</name>
				<description>DMA2 Channel8 global interrupt</description>
				<value>109</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>DMAMUX</name>
			<description>DMA request multiplexer</description>
			<groupName>DMAMUX</groupName>
			<baseAddress>0x40020800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DMAMUX1_4_CFGR</name>
					<displayName>DMAMUX1_4_CFGR</displayName>
					<description>DMA request multiplexer channels 1 to 4 configuration registers</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CHANNEL1_MUX</name>
							<description>DMA request multiplexer channels 1 intput to the volunteer configuration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANNEL2_MUX</name>
							<description>DMA request multiplexer channels 2 intput to the volunteer configuration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANNEL3_MUX</name>
							<description>DMA request multiplexer channels 3 intput to the volunteer configuration</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANNEL4_MUX</name>
							<description>DMA request multiplexer channels 4 intput to the volunteer configuration</description>
							<bitOffset>24</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAMUX5_8_CFGR</name>
					<displayName>DMAMUX4_7_CFGR</displayName>
					<description>DMA request multiplexer channels 5 to 8 configuration registers</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CHANNEL5_MUX</name>
							<description>DMA request multiplexer channels 5 intput to the volunteer configuration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANNEL6_MUX</name>
							<description>DMA request multiplexer channels 6 intput to the volunteer configuration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANNEL7_MUX</name>
							<description>DMA request multiplexer channels 7 intput to the volunteer configuration</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANNEL8_MUX</name>
							<description>DMA request multiplexer channels 8 intput to the volunteer configuration</description>
							<bitOffset>24</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAMUX9_12_CFGR</name>
					<displayName>DMAMUX9_12_CFGR</displayName>
					<description>DMA request multiplexer channels 9 to 12 configuration registers</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CHANNEL9_MUX</name>
							<description>DMA request multiplexer channels 9 intput to the volunteer configuration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANNEL10_MUX</name>
							<description>DMA request multiplexer channels 10 intput to the volunteer configuration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANNEL11_MUX</name>
							<description>DMA request multiplexer channels 11 intput to the volunteer configuration</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANNEL12_MUX</name>
							<description>DMA request multiplexer channels 12 intput to the volunteer configuration</description>
							<bitOffset>24</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAMUX13_16_CFGR</name>
					<displayName>DMAMUX13_16_CFGR</displayName>
					<description>DMA request multiplexer channels 13 to 16 configuration registers</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CHANNEL13_MUX</name>
							<description>DMA request multiplexer channels 13 intput to the volunteer configuration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANNEL14_MUX</name>
							<description>DMA request multiplexer channels 14 intput to the volunteer configuration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANNEL15_MUX</name>
							<description>DMA request multiplexer channels 15 intput to the volunteer configuration</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHANNEL16_MUX</name>
							<description>DMA request multiplexer channels 16 intput to the volunteer configuration</description>
							<bitOffset>24</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
