Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ESIG</name>
			<description>ESIG configuration</description>
			<groupName>ESIG</groupName>
			<baseAddress>0x1FFFF7E0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x200</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>FLACAP</name>
					<displayName>FLACAP</displayName>
					<description>Flash capecity register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>F_SIZE</name>
							<description>F_SIZE/kByte</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UNIID1</name>
					<displayName>UNIID1</displayName>
					<description>UID register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>U_ID</name>
							<description>U_ID value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UNIID2</name>
					<displayName>UNIID2</displayName>
					<description>UID register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>U_ID</name>
							<description>U_ID value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UNIID3</name>
					<displayName>UNIID3</displayName>
					<description>Div register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>U_ID</name>
							<description>U_ID value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>ADC1</name>
			<description>Analog to digital converter</description>
			<groupName>ADC1</groupName>
			<baseAddress>0x40012400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC</name>
				<description>ADC global interrupt</description>
				<value>69</value>
			</interrupt>
			<registers>
				<register>
					<name>STATR</name>
					<displayName>STATR</displayName>
					<description>status register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ADCRSTF</name>
							<description>ADC reset flag</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STRT</name>
							<description>Regular channel start flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JSTRT</name>
							<description>Injected channel start
              flag							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JEOC</name>
							<description>Injected channel end of
              conversion							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EOC</name>
							<description>Regular channel end of
              conversion							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AWD</name>
							<description>Analog watchdog flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTLR1</name>
					<displayName>CTLR1</displayName>
					<description>control register 1/TKEY_V_CTLR</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SW_PRE</name>
							<description>Channel pre-handoff is closed</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ANA_RST</name>
							<description>simulation module reset enabled</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PGA</name>
							<description>ADC_PGA</description>
							<bitOffset>27</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>BUFEN</name>
							<description>TKEY_BUF_Enable</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TKITUNE</name>
							<description>TKEY_I enable</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TKENABLE</name>
							<description>TKEY enable, including TKEY_F and
              TKEY_V							</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AWDEN</name>
							<description>Analog watchdog enable on regular
              channels							</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JAWDEN</name>
							<description>Analog watchdog enable on injected
              channels							</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DUALMOD</name>
							<description>Dual mode selection</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DISCNUM</name>
							<description>Discontinuous mode channel
              count							</description>
							<bitOffset>13</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>JDISCEN</name>
							<description>Discontinuous mode on injected
              channels							</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DISCEN</name>
							<description>Discontinuous mode on regular
              channels							</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JAUTO</name>
							<description>Automatic injected group
              conversion							</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AWDSGL</name>
							<description>Enable the watchdog on a single channel
              in scan mode							</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SCAN</name>
							<description>Scan mode enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JEOCIE</name>
							<description>Interrupt enable for injected
              channels							</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AWDIE</name>
							<description>Analog watchdog interrupt
              enable							</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EOCIE</name>
							<description>Interrupt enable for EOC</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AWDCH</name>
							<description>Analog watchdog channel select
              bits							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTLR2</name>
					<displayName>CTLR2</displayName>
					<description>control register 2</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TSVREFE</name>
							<description>Temperature sensor and VREFINT
              enable							</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWSTART</name>
							<description>Start conversion of regular
              channels							</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JSWSTART</name>
							<description>Start conversion of injected
              channels							</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTTRIG</name>
							<description>External trigger conversion mode for
              regular channels							</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTSEL</name>
							<description>External event select for regular
              group							</description>
							<bitOffset>17</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>JEXTTRIG</name>
							<description>External trigger conversion mode for
              injected channels							</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JEXTSEL</name>
							<description>External event select for injected
              group							</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>ALIGN</name>
							<description>Data alignment</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMA</name>
							<description>Direct memory access mode</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_LP</name>
							<description>ADC low power mode control</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CAL_AUTO</name>
							<description>the hardware automatic calibration</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CAL_VOL</name>
							<description>calibration voltage configuration</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>RSTCAL</name>
							<description>Reset calibration</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CAL</name>
							<description>A/D calibration</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CONT</name>
							<description>Continuous conversion</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADON</name>
							<description>A/D converter ON / OFF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SAMPTR1_CHARGE1</name>
					<displayName>SAMPTR1_CHARGE1</displayName>
					<description>sample time register 1</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SMP10_TKCG10</name>
							<description>Channel 10 sample time
              selection							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMP11_TKCG11</name>
							<description>Channel 11 sample time
              selection							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMP12_TKCG12</name>
							<description>Channel 12 sample time
              selection							</description>
							<bitOffset>6</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMP13_TKCG13</name>
							<description>Channel 13 sample time
              selection							</description>
							<bitOffset>9</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMP14_TKCG14</name>
							<description>Channel 14 sample time
              selection							</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMP15_TKCG15</name>
							<description>Channel 15 sample time
              selection							</description>
							<bitOffset>15</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMP16</name>
							<description>Channel 16 sample time
              selection							</description>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMP17</name>
							<description>Channel 17 sample time
              selection							</description>
							<bitOffset>21</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SAMPTR2_CHARGE2</name>
					<displayName>SAMPTR2_CHARGE2</displayName>
					<description>sample time register 2</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SMP0_TKCG0</name>
							<description>Channel 0 sample time
              selection							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMP1_TKCG1</name>
							<description>Channel 1 sample time
              selection							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMP2_TKCG2</name>
							<description>Channel 2 sample time
              selection							</description>
							<bitOffset>6</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMP3_TKCG3</name>
							<description>Channel 3 sample time
              selection							</description>
							<bitOffset>9</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMP4_TKCG4</name>
							<description>Channel 4 sample time
              selection							</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMP5_TKCG5</name>
							<description>Channel 5 sample time
              selection							</description>
							<bitOffset>15</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMP6_TKCG6</name>
							<description>Channel 6 sample time
              selection							</description>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMP7_TKCG7</name>
							<description>Channel 7 sample time
              selection							</description>
							<bitOffset>21</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMP8_TKCG8</name>
							<description>Channel 8 sample time
              selection							</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SMP9_TKCG9</name>
							<description>Channel 9 sample time
              selection							</description>
							<bitOffset>27</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IOFR1</name>
					<displayName>IOFR1</displayName>
					<description>injected channel data offset register
          x					</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>JOFFSET1</name>
							<description>Data offset for injected channel
              x							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IOFR2</name>
					<displayName>IOFR2</displayName>
					<description>injected channel data offset register
          x					</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>JOFFSET2</name>
							<description>Data offset for injected channel
              x							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IOFR3</name>
					<displayName>IOFR3</displayName>
					<description>injected channel data offset register
          x					</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>JOFFSET3</name>
							<description>Data offset for injected channel
              x							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IOFR4</name>
					<displayName>IOFR4</displayName>
					<description>injected channel data offset register
          x					</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>JOFFSET4</name>
							<description>Data offset for injected channel
              x							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>WDHTR</name>
					<displayName>WDHTR</displayName>
					<description>watchdog higher threshold
          register					</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000FFF</resetValue>
					<fields>
						<field>
							<name>HT</name>
							<description>Analog watchdog higher
              threshold							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>WDLTR</name>
					<displayName>WDLTR</displayName>
					<description>watchdog lower threshold
          register					</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LT</name>
							<description>Analog watchdog lower
              threshold							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RSQR1</name>
					<displayName>RSQR1</displayName>
					<description>regular sequence register 1</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>L</name>
							<description>Regular channel sequence
              length							</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SQ16</name>
							<description>16th conversion in regular
              sequence							</description>
							<bitOffset>15</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>SQ15</name>
							<description>15th conversion in regular
              sequence							</description>
							<bitOffset>10</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>SQ14</name>
							<description>14th conversion in regular
              sequence							</description>
							<bitOffset>5</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>SQ13</name>
							<description>13th conversion in regular
              sequence							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RSQR2</name>
					<displayName>RSQR2</displayName>
					<description>regular sequence register 2</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SQ12</name>
							<description>12th conversion in regular
              sequence							</description>
							<bitOffset>25</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>SQ11</name>
							<description>11th conversion in regular
              sequence							</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>SQ10</name>
							<description>10th conversion in regular
              sequence							</description>
							<bitOffset>15</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>SQ9</name>
							<description>9th conversion in regular
              sequence							</description>
							<bitOffset>10</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>SQ8</name>
							<description>8th conversion in regular
              sequence							</description>
							<bitOffset>5</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>SQ7</name>
							<description>7th conversion in regular
              sequence							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RSQR3</name>
					<displayName>RSQR3</displayName>
					<description>regular sequence register 3</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SQ6</name>
							<description>6th conversion in regular
              sequence							</description>
							<bitOffset>25</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>SQ5</name>
							<description>5th conversion in regular
              sequence							</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>SQ4</name>
							<description>4th conversion in regular
              sequence							</description>
							<bitOffset>15</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>SQ3</name>
							<description>3rd conversion in regular
              sequence							</description>
							<bitOffset>10</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>SQ2</name>
							<description>2nd conversion in regular
              sequence							</description>
							<bitOffset>5</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>SQ1</name>
							<description>1st conversion in regular
              sequence							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
					</fields>
				</register>
