Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="LPTIM1">
			<name>LPTIM2</name>
			<baseAddress>0x40003400</baseAddress>
			<interrupt>
				<name>LPTIM2WakeUP</name>
				<description>LPTIM2 wake-up interrupt</description>
				<value>140</value>
			</interrupt>
			<interrupt>
				<name>LPTIM2</name>
				<description>LPTIM2 global interrupt</description>
				<value>97</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>DAC</name>
			<description>Digital to analog converter</description>
			<groupName>DAC</groupName>
			<baseAddress>0x40007400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CTLR</name>
					<displayName>CTLR</displayName>
					<description>Control register (DAC_CR)</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EN1</name>
							<description>DAC channel1 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BOFF1</name>
							<description>DAC channel1 output buffer
              disable							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEN1</name>
							<description>DAC channel1 trigger
              enable							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TSEL1</name>
							<description>DAC channel1 trigger
              selection							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>WAVE1</name>
							<description>DAC channel1 noise/triangle wave
              generation enable							</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MAMP1</name>
							<description>DAC channel1 mask/amplitude
              selector							</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DMAEN1</name>
							<description>DAC channel1 DMA enable</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EN2</name>
							<description>DAC channel2 enable</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BOFF2</name>
							<description>DAC channel2 output buffer
              disable							</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEN2</name>
							<description>DAC channel2 trigger
              enable							</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TSEL2</name>
							<description>DAC channel2 trigger
              selection							</description>
							<bitOffset>19</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>WAVE2</name>
							<description>DAC channel2 noise/triangle wave
              generation enable							</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MAMP2</name>
							<description>DAC channel2 mask/amplitude
              selector							</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DMAEN2</name>
							<description>DAC channel2 DMA enable</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SWTR</name>
					<displayName>SWTR</displayName>
					<description>DAC software trigger register
          (DAC_SWTRIGR)					</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SWTRIG1</name>
							<description>DAC channel1 software
              trigger							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWTRIG2</name>
							<description>DAC channel2 software
              trigger							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>R12BDHR1</name>
					<displayName>R12BDHR1</displayName>
					<description>DAC channel1 12-bit right-aligned data
          holding register(DAC_DHR12R1)					</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DACC1DHR</name>
							<description>DAC channel1 12-bit right-aligned
              data							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>L12BDHR1</name>
					<displayName>L12BDHR1</displayName>
					<description>DAC channel1 12-bit left aligned data
          holding register (DAC_DHR12L1)					</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DACC1DHR</name>
							<description>DAC channel1 12-bit left-aligned
              data							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>R8BDHR1</name>
					<displayName>R8BDHR1</displayName>
					<description>DAC channel1 8-bit right aligned data
          holding register (DAC_DHR8R1)					</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DACC1DHR</name>
							<description>DAC channel1 8-bit right-aligned
              data							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>R12BDHR2</name>
					<displayName>R12BDHR2</displayName>
					<description>DAC channel2 12-bit right aligned data
          holding register (DAC_DHR12R2)					</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DACC2DHR</name>
							<description>DAC channel2 12-bit right-aligned
              data							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>L12BDHR2</name>
					<displayName>L12BDHR2</displayName>
					<description>DAC channel2 12-bit left aligned data
          holding register (DAC_DHR12L2)					</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DACC2DHR</name>
							<description>DAC channel2 12-bit left-aligned
              data							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>R8BDHR2</name>
					<displayName>R8BDHR2</displayName>
					<description>DAC channel2 8-bit right-aligned data
          holding register (DAC_DHR8R2)					</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DACC2DHR</name>
							<description>DAC channel2 8-bit right-aligned
              data							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RD12BDHR</name>
					<displayName>RD12BDHR</displayName>
					<description>Dual DAC 12-bit right-aligned data holding
          register (DAC_DHR12RD), Bits 31:28 Reserved, Bits 15:12
          Reserved					</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DACC1DHR</name>
							<description>DAC channel1 12-bit right-aligned
              data							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
						<field>
							<name>DACC2DHR</name>
							<description>DAC channel2 12-bit right-aligned
              data							</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>LD12BDHR</name>
					<displayName>LD12BDHR</displayName>
					<description>DUAL DAC 12-bit left aligned data holding
          register (DAC_DHR12LD), Bits 19:16 Reserved, Bits 3:0
          Reserved					</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DACC1DHR</name>
							<description>DAC channel1 12-bit left-aligned
              data							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
						<field>
							<name>DACC2DHR</name>
							<description>DAC channel2 12-bit right-aligned
              data							</description>
							<bitOffset>20</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RD8BDHR</name>
					<displayName>RD8BDHR</displayName>
					<description>DUAL DAC 8-bit right aligned data holding
          register (DAC_DHR8RD), Bits 31:16 Reserved					</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DACC1DHR</name>
							<description>DAC channel1 8-bit right-aligned
              data							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>DACC2DHR</name>
							<description>DAC channel2 8-bit right-aligned
              data							</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DOR1</name>
					<displayName>DOR1</displayName>
					<description>DAC channel1 data output register
          (DAC_DOR1)					</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DACC1DOR</name>
							<description>DAC channel1 data output</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DOR2</name>
					<displayName>DOR2</displayName>
					<description>DAC channel2 data output register
          (DAC_DOR2)					</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DACC2DOR</name>
							<description>DAC channel2 data output</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
