Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>USBHS</name>
			<description>USB register</description>
			<groupName>USBHS</groupName>
			<baseAddress>0x40030000</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>USBHS</name>
				<description>USBHS global interrupt</description>
				<value>56</value>
			</interrupt>
			<interrupt>
				<name>USBHSWakeUP</name>
				<description>USBHS Wakeup interrupt</description>
				<value>64</value>
			</interrupt>
			<registers>
				<register>
					<name>R8_USB_CTRL</name>
					<description>USB base control register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x07</resetValue>
					<fields>
						<field>
							<name>RB_UD_RST_LINK</name>
							<description>LINK layer reset,highly effective</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_UD_RST_SIE</name>
							<description>USB protocol processor reset</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_UD_CLR_ALL</name>
							<description>clear all interrupt flags</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_UD_PHY_SUSPENDM</name>
							<description>USB PHY suspend</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_UD_DMA_EN</name>
							<description>DMA transfer enabled</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_UD_DEV_EN</name>
							<description>USB device enabled</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_UD_LPM_EN</name>
							<description>LPM enable</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_USB_BASE_MODE</name>
					<description>USB mode control register</description>
					<addressOffset>0x01</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UD_SPEED_TYPE</name>
							<description>The desired speed mode of the device</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_USB_INT_EN</name>
					<description>USB interrupt enable register</description>
					<addressOffset>0x02</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UDIE_BUS_RST</name>
							<description>USB bus reset interrupt enabled</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_UDIE_SUSPEND</name>
							<description>USB bus pause interrupt enabled</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_UDIE_BUS_SLEEP</name>
							<description>USB bus sleep interrupt enabled</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_UDIE_LPM_ACT</name>
							<description>LMP transfer end interrupt enabled</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_UDIE_TRANSFER</name>
							<description>USB transfer end interrupt enabled</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_UDIE_SOF_ACT</name>
							<description>Receive SOF packet interrupt enable</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_UDIE_LINK_RDY</name>
							<description>USB connection interrupt enable</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RB_UDIE_FIFO_OVER</name>
							<description>USB Overflow interrupt enable</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_USB_DEV_AD</name>
					<description>USB device address</description>
					<addressOffset>0x03</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_MASK_USB_ADDR</name>
							<description>bit mask for USB device address</description>
							<bitRange>[6:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_USB_WAKE_CTRL</name>
					<description>USB remote wake up register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RB_UD_REMOTE_WKUP</name>
							<description>remote wake up</description>
							<bitRange>[0:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_USB_TEST_MODE</name>
					<description>USB test mode register</description>
					<addressOffset>0x05</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UD_TEST_J</name>
							<description>test mode,output J</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_UD_TEST_K</name>
							<description>test mode,output K</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_UD_TEST_PKT</name>
							<description>test mode,output a packet</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_UD_TEST_SE0NAK</name>
							<description>test mode,output SEO</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_UD_TEST_EN</name>
							<description>test mode enable</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_USB_LPM_DATA</name>
					<description>USB power management register</description>
					<addressOffset>0x06</addressOffset>
					<size>0x10</size>
					<resetValue>0x8000</resetValue>
					<fields>
						<field>
							<name>RB_UD_LPM_DATA</name>
							<description>power management data</description>
							<bitRange>[10:0]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UD_LPM_BUSY</name>
							<description>power management busy</description>
							<bitRange>[15:15]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_USB_INT_FG</name>
					<description>USB interrupt flag register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UDIF_BUS_RST</name>
							<description>USB bus reset interrupt flag</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UDIF_SUSPEND</name>
							<description>USB bus suspend interrupt flag</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UDIF_BUS_SLEEP</name>
							<description>USB bus sleep interrupt flag</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UDIF_LPM_ACT</name>
							<description>LPM transmission end interrupt flag</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UDIF_RTX_ACT</name>
							<description>USB transmission end interrupt flag</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UDIF_RX_SOF</name>
							<description>Receive SOF packet interrupt flag</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UDIF_LINK_RDY</name>
							<description>USB connection interrupt flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UDIF_FIFO_OV</name>
							<description>USB Overflow interrupt flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_USB_INT_ST</name>
					<description>USB interrupt status</description>
					<addressOffset>0x09</addressOffset>
					<size>0x08</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UDIS_EP_ID_MASK</name>
							<description>The endpoint number at which the data transfer occurs</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>RB_UDIS_EP_DIR</name>
							<description>Endpoint data transmission direction</description>
							<bitRange>[4:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_USB_MIS_ST</name>
					<description>USB miscellaneous status</description>
					<addressOffset>0x0A</addressOffset>
					<size>0x08</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UDMS_READY</name>
							<description>USB connection status</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_UDMS_SUSPEND</name>
							<description>USB suspend status</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_UDMS_SLEEP</name>
							<description>USB sleep status</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_UDMS_SIE_FREE</name>
							<description>USB free status</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_UDMS_SUSP_REQ</name>
							<description>USB suspends the request</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_UDMS_HS_MOD</name>
							<description>whether the host is high-speed</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_USB_FRAM_NO</name>
					<description>USB frame number</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RB_UD_MFRAME_NO</name>
							<description>Received micro frame number</description>
							<bitRange>[15:13]</bitRange>
						</field>
						<field>
							<name>RB_UD_FRAME_NO</name>
							<description>Received frame number</description>
							<bitRange>[10:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_USB_BUS</name>
					<description>USB bus</description>
					<addressOffset>0x0E</addressOffset>
					<size>0X10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RB_USB_DM_ST</name>
							<description>UDM status</description>
							<bitRange>[3:3]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_USB_DP_ST</name>
							<description>UDP status</description>
							<bitRange>[2:2]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_USB_WAKEUP</name>
							<description>USB wakeup</description>
							<bitRange>[0:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP_TX_EN</name>
					<description>USB endpoint sends the enable register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_TX_EN</name>
							<description>Endpoint 0 to 15 sends enable</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP_RX_EN</name>
					<description>USB endpoint receive the enable registers</description>
					<addressOffset>0x12</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_RX_EN</name>
							<description>Endpoint 0 to 15 receive enable</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_UEP_T_TOG_AUTO</name>
					<description>USB endpoint sends the auto-filp enable register</description>
					<addressOffset>0x14</addressOffset>
					<size>0X10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_T_TOG_AUTO</name>
							<description>0 to 7 endpoint synchronization triggers bit auto-filp
								enable							</description>
							<bitRange>[7:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_UEP_R_TOG_AUTO</name>
					<description>USB endpoint receive the auto-filp enable register</description>
					<addressOffset>0x16</addressOffset>
					<size>0X10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_R_TOG_AUTO</name>
							<description>0 to 7 endpoint synchronization triggers bit auto-filp
								enable							</description>
							<bitRange>[7:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP_T_BURST</name>
					<description>USB endpoint sends a burst register</description>
					<addressOffset>0x18</addressOffset>
					<size>0X8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_T_BURST_EN</name>
							<description>0 to 7 endpoint send burst enable</description>
							<bitRange>[7:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_UEP_T_BURST_MODE</name>
					<description>USB endpoint send the mode register</description>
					<addressOffset>0x19</addressOffset>
					<size>0X8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_T_BURST_MODE</name>
							<description>0 to 7 endpoint send the mode enable</description>
							<bitRange>[7:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP_R_BURST</name>
					<description>USB endpoint receives the burst register</description>
					<addressOffset>0x1A</addressOffset>
					<size>0X8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_R_BURST_EN</name>
							<description>0 to 7 endpoint receive burst enable</description>
							<bitRange>[7:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP_R_RES_MODE</name>
					<description>USB endpoint reply mode register</description>
					<addressOffset>0x1B</addressOffset>
					<size>0X8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_R_RES_MODE</name>
							<description>0 to 7 endpoint reply mode</description>
							<bitRange>[7:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP_AF_MODE</name>
					<description>USB endpoint muitiplexing register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0X20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_T_AF</name>
							<description>1 to 7 endpoint muitiplexing enables</description>
							<bitRange>[7:1]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP0_DMA</name>
					<description>The start address register of the endpoint 0 buffer</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP0_DMA</name>
							<description>The start address of the endpoint 0 buffer</description>
							<bitRange>[23:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP1_RX_DMA</name>
					<description>endpoint 1 receives the start address register of the buffer</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP1_RX_DMA</name>
							<description>endpoint receives the start address register of the buffer</description>
							<bitRange>[23:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP2_RX_DMA</name>
					<description>endpoint 2 receives the start address register of the buffer</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP2_RX_DMA</name>
							<description>endpoint receives the start address register of the buffer</description>
							<bitRange>[23:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP3_RX_DMA</name>
					<description>endpoint 3 receives the start address register of the buffer</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP3_RX_DMA</name>
							<description>endpoint receives the start address register of the buffer</description>
							<bitRange>[23:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP4_RX_DMA</name>
					<description>endpoint 4 receives the start address register of the buffer</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP4_RX_DMA</name>
							<description>endpoint receives the start address register of the buffer</description>
							<bitRange>[23:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP5_RX_DMA</name>
					<description>endpoint 5 receives the start address register of the buffer</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP5_RX_DMA</name>
							<description>endpoint receives the start address register of the buffer</description>
							<bitRange>[23:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP6_RX_DMA</name>
					<description>endpoint 6 receives the start address register of the buffer</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP6_RX_DMA</name>
							<description>endpoint receives the start address register of the buffer</description>
							<bitRange>[23:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP7_RX_DMA</name>
					<description>endpoint 7 receives the start address register of the buffer</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP7_RX_DMA</name>
							<description>endpoint receives the start address register of the buffer</description>
							<bitRange>[23:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP1_TX_DMA</name>
					<description>endpoint 1 sends the start address register of the buffer</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP1_TX_DMA</name>
							<description>endpoint sends the start address register of the buffer</description>
							<bitRange>[23:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP2_TX_DMA</name>
					<description>endpoint 2 sends the start address register of the buffer</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP2_TX_DMA</name>
							<description>endpoint sends the start address register of the buffer</description>
							<bitRange>[23:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP3_TX_DMA</name>
					<description>endpoint 3 sends the start address register of the buffer</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP3_TX_DMA</name>
							<description>endpoint sends the start address register of the buffer</description>
							<bitRange>[23:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP4_TX_DMA</name>
					<description>endpoint 4 sends the start address register of the buffer</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP4_TX_DMA</name>
							<description>endpoint sends the start address register of the buffer</description>
							<bitRange>[23:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP5_TX_DMA</name>
					<description>endpoint 5 sends the start address register of the buffer</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP5_TX_DMA</name>
							<description>endpoint sends the start address register of the buffer</description>
							<bitRange>[23:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP6_TX_DMA</name>
					<description>endpoint 6 sends the start address register of the buffer</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP6_TX_DMA</name>
							<description>endpoint sends the start address register of the buffer</description>
							<bitRange>[23:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP7_TX_DMA</name>
					<description>endpoint 7 sends the start address register of the buffer</description>
					<addressOffset>0x58</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP7_TX_DMA</name>
							<description>endpoint sends the start address register of the buffer</description>
							<bitRange>[23:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
