Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup.svd
				<register>
					<name>R32_UEP5_TX_FIFO</name>
					<description>The sending FIFO address of usb endpoint 5</description>
					<addressOffset>0xEC</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_TX_FIFO_E</name>
							<description>The end FIFO address of the sending endpoint</description>
							<bitRange>[31:16]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_TX_FIFO_S</name>
							<description>The FIFO start address of the sending endpoint</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP6_TX_FIFO</name>
					<description>The sending FIFO address of usb endpoint 6</description>
					<addressOffset>0xF0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_TX_FIFO_E</name>
							<description>The end FIFO address of the sending endpoint</description>
							<bitRange>[31:16]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_TX_FIFO_S</name>
							<description>The FIFO start address of the sending endpoint</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP7_TX_FIFO</name>
					<description>The sending FIFO address of usb endpoint 7</description>
					<addressOffset>0xF4</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_TX_FIFO_E</name>
							<description>The end FIFO address of the sending endpoint</description>
							<bitRange>[31:16]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_TX_FIFO_S</name>
							<description>The FIFO start address of the sending endpoint</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UH_CFG</name>
					<description>USB host Configuration register</description>
					<addressOffset>0x100</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x07</resetValue>
					<fields>
						<field>
							<name>RB_UH_RST_LINK</name>
							<description>USB connection controller module resets</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_UH_RST_SIE</name>
							<description>USB protocol processor reset</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_UH_CLR_ALL</name>
							<description>clear all interrupt flags</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_UH_PHY_SUSPENDM</name>
							<description>PHY suspend,close utmi clock</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_UH_DMA_EN</name>
							<description>DMA transfer enabled</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_UH_SOF_EN</name>
							<description>sof packet sending function enabled</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_UH_FORCE_FS</name>
							<description>forced full speed FS</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RB_UH_LPM_EN</name>
							<description>LPM enable</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UH_INT_EN</name>
					<description>USB host interrupt enable register</description>
					<addressOffset>0x102</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UHIE_WKUP_ACT</name>
							<description>Wakeup interrupt enabled</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_UHIE_RESUME_ACT</name>
							<description>bus recovery interrupt was enabled</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_UHIE_TRANSFER</name>
							<description>USB transfer end interrupt enabled</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_UHIE_SOF_ACT</name>
							<description>sof packet sending interruption is enabled</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_UHIE_TX_HALT</name>
							<description>send pause interrupt enable</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RB_UHIE_FIFO_OVER</name>
							<description>FIFO overflow interrupt enable</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UH_DEV_AD</name>
					<description>USB host device address register</description>
					<addressOffset>0x103</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UH_DEV_ADDR</name>
							<description>device address</description>
							<bitRange>[6:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_CONTROL</name>
					<description>USB host control register</description>
					<addressOffset>0x104</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UH_RX_NO_RES</name>
							<description>IN-DATA no answer,used for synchronous transfer or
								high-speed SPLIT packets							</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>RB_UH_TX_NO_RES</name>
							<description>OUT or SETUP DATA no reply is extended and is used for
								synchronous transmission or hign-speed SPLIT packets							</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>RB_UH_RX_NO_DATA</name>
							<description>DATA packets are not expected after IN token packets and
								are used for
								high-speed SPLIT packets							</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>RB_UH_TX_NO_DATA</name>
							<description>OUT or SETUP token packet packets are followed by no data
								packets for hign-speed SPLIT packets							</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>RB_UH_PRE_PID_EN</name>
							<description>this bit is enabled when the port is operating at full
								speed and needs to send low speed packets(PRE)							</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>RB_UH_SPLIT_VALID</name>
							<description>valid to send SPLIT packet</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>RB_UH_LPM_VALID</name>
							<description>valid to send LMP packet</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>RB_UH_HOST_ACTION</name>
							<description>host enables the transaction</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>RB_UH_BUF_MODE</name>
							<description>DATA cache control bit</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RB_UH_T_TOG_MASK</name>
							<description>send data PID</description>
							<bitRange>[9:8]</bitRange>
						</field>
						<field>
							<name>RB_UH_T_ENDP_MASK</name>
							<description>transaction token packet endpoint number</description>
							<bitRange>[7:4]</bitRange>
						</field>
						<field>
							<name>RB_UH_T_TOKEN_MASK</name>
							<description>transaction token packet PID</description>
							<bitRange>[3:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UH_INT_FLAG</name>
					<description>USB HOST interrupt flag register</description>
					<addressOffset>0x108</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<access>read-write</access>
					<fields>
						<field>
							<name>RB_UHIF_WKUP_ACT</name>
							<description>Wakeup interrupt flag</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_UHIF_RESUME_ACT_IF</name>
							<description>bus recovery interrupt flag</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_UHIF_TRANSFER</name>
							<description>USB transaction transfer completion interrupt flag</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_UHIF_SOF_ACT</name>
							<description>sof packet delivert completion interrupt flag</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_UHIF_TX_HALT</name>
							<description>send pause interrupt flag</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RB_UHIF_FIFO_OVER</name>
							<description>FIFO overflow interrupt flag</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UH_INT_ST</name>
					<description>USB host interrupt status</description>
					<addressOffset>0x109</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UH_R_TOKEN_MASK</name>
							<description>received PID</description>
							<bitRange>[3:0]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UHIS_PORT_RX_RESUME</name>
							<description>A bit of indicates that the port received a wakeup signal</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UH_MIS_ST</name>
					<description>USB host miscellaneous status</description>
					<addressOffset>0x10A</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UHMS_SOF_FREE</name>
							<description>port enabled state</description>
							<bitRange>[0:0]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UHMS_SOF_PRE</name>
							<description>The state of the USB SOF packet is indicated as follows</description>
							<bitRange>[1:1]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UHMS_SOF_ACT</name>
							<description>USB bus SOF status</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UHMS_USB_WAKEUP</name>
							<description>USB bus wakes up</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UHMS_LINESTATE</name>
							<description>USB bus status</description>
							<bitRange>[5:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UHMS_BUS_J</name>
							<description>J on USB bus</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UHMS_BUS_SE0</name>
							<description>SE0 on USB bus</description>
							<bitRange>[7:7]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_LPM_DATA</name>
					<description>USB host power management data register</description>
					<addressOffset>0x10C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UH_LPM_DATA</name>
							<description>power management data</description>
							<bitRange>[10:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_SPLIT_DATA</name>
					<description>USB host SPLIT register</description>
					<addressOffset>0x110</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UH_SPLIT_DATA</name>
							<description>SPLIT management data</description>
							<bitRange>[18:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_FRAME</name>
					<description>USB host frame register</description>
					<addressOffset>0x114</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UH_FRAME_NO</name>
							<description>the frame number</description>
							<bitRange>[10:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UH_MFRAME_NO</name>
							<description>microfame number</description>
							<bitRange>[18:16]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UH_SOF_CNT_EN</name>
							<description>SOF count enabled</description>
							<bitRange>[24:24]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UH_SOF_CNT_CLR</name>
							<description>the SOF count is cleared</description>
							<bitRange>[25:25]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_TX_LEN</name>
					<description>USB host send length register</description>
					<addressOffset>0x118</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UH_TX_LEN</name>
							<description>send data length</description>
							<bitRange>[10:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_RX_LEN</name>
					<description>USB host receive length register</description>
					<addressOffset>0x11C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UH_RX_LEN</name>
							<description>Received data length</description>
							<bitRange>[10:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_RX_MAX_LEN</name>
					<description>USB host receives the maximum length register</description>
					<addressOffset>0x120</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UH_RX_MAX_LEN</name>
							<description>receives the maximum length</description>
							<bitRange>[10:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_RX_DMA</name>
					<description>DMA receive address register</description>
					<addressOffset>0x124</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>R32_UH_RX_DMA</name>
							<description>Received address</description>
							<bitRange>[23:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_TX_DMA</name>
					<description>DMA send address register</description>
					<addressOffset>0x128</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>R32_UH_TX_DMA</name>
							<description>Send address</description>
							<bitRange>[23:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_PORT_CTRL</name>
					<description>USB host port control register</description>
					<addressOffset>0x12C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UH_BUS_RST_LONG</name>
							<description>BUS reset time selection</description>
							<bitRange>[16:16]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UH_PORT_SLEEP_BESL</name>
							<description>wake-up time control</description>
							<bitRange>[15:12]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UH_CLR_PORT_SLEEP</name>
							<description>the PORT exits the sleep state (LPM)</description>
							<bitRange>[8:8]</bitRange>
							<access>write-only</access>
						</field>
						<field>
							<name>RB_UH_CLR_PORT_CONNECT</name>
							<description>bring the PORT into the port state</description>
							<bitRange>[5:5]</bitRange>
							<access>write-only</access>
						</field>
						<field>
							<name>RB_UH_CLR_PORT_EN</name>
							<description>PORT exits the enabled state and enters the DISABLED state</description>
							<bitRange>[4:4]</bitRange>
							<access>write-only</access>
						</field>
						<field>
							<name>RB_UH_SET_PORT_SLEEP</name>
							<description>the PORT goes to sleep(LPM)</description>
							<bitRange>[3:3]</bitRange>
							<access>write-only</access>
						</field>
						<field>
							<name>RB_UH_CLR_PORT_SUSP</name>
							<description>the PORT exits the suspended state</description>
							<bitRange>[2:2]</bitRange>
							<access>write-only</access>
						</field>
						<field>
							<name>RB_UH_SET_PORT_SUSP</name>
							<description>the PORT is in a suspended state</description>
							<bitRange>[1:1]</bitRange>
							<access>write-only</access>
						</field>
						<field>
							<name>RB_UH_SET_PORT_RESET</name>
							<description>PORT send reset</description>
							<bitRange>[0:0]</bitRange>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UH_PORT_CFG</name>
					<description>USB host port Configuration register</description>
					<addressOffset>0x130</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UH_PD_EN</name>
							<description>the 15k resistance drop-down function is enable in host
								mode							</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UH_HOST_EN</name>
							<description>USB port mode selection</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UH_PORT_INT_EN</name>
					<description>USB host port interrupt enable register</description>
					<addressOffset>0x132</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UHIE_PORT_SLP</name>
							<description>port sleep state change interrupt enabled</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UHIE_PORT_RESET</name>
							<description>port reset state change interrupt enabled</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UHIE_PORT_SUSP</name>
							<description>port pause state change interrupt enabled</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UHIE_PORT_EN</name>
							<description>port enable state change interrupt enabled</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UHIE_PORT_CONNECT</name>
							<description>port connection state change interrupt enabled</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UH_PORT_TEST_CT</name>
					<description>USB host port test mode register</description>
					<addressOffset>0x133</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UH_TEST_SE0_NAK</name>
							<description>test SE0 NAK</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UH_TEST_PACKET</name>
							<description>test packet</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UH_TEST_FORCE_EN</name>
							<description>test mode was enabled</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UH_TEST_K</name>
							<description>test output K</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UH_TEST_J</name>
							<description>test output J</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_UH_PORT_ST</name>
					<description>USB host port status register</description>
					<addressOffset>0x134</addressOffset>
					<size>0x10</size>
					<resetValue>0x0010</resetValue>
					<fields>
						<field>
							<name>RB_UHIS_PORT_TEST</name>
							<description>whether the port is in test mode</description>
							<bitRange>[11:11]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UHIS_PORT_HS</name>
							<description>whether the port connection speed is hign</description>
							<bitRange>[10:10]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UHIS_PORT_LS</name>
							<description>whether the port connection speed is low</description>
							<bitRange>[9:9]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UHIS_PORT_SLP</name>
							<description>port sleep</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UHIS_PORT_RST</name>
							<description>port reset status</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UHIS_PORT_SUSP</name>
							<description>port pause state</description>
							<bitRange>[2:2]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UHIS_PORT_EN</name>
							<description>port enabled</description>
							<bitRange>[1:1]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UHIS_PORT_C0NNECT</name>
							<description>port connection state</description>
							<bitRange>[0:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
