Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup.svd
				<register>
					<name>R8_UH_PORT_CHG</name>
					<description>USB host port state charge register</description>
					<addressOffset>0x136</addressOffset>
					<size>0x10</size>
					<resetValue>0x0010</resetValue>
					<fields>
						<field>
							<name>RB_UHIF_PORT_SLP</name>
							<description>port sleep state charge</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UHIF_PORT_RESET</name>
							<description>port reset state charge</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UHIF_PORT_SUSP</name>
							<description>port pause state charge</description>
							<bitRange>[2:2]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UHIF_PORT_EN</name>
							<description>port enable state charge</description>
							<bitRange>[1:1]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UHIF_PORT_CONNECT</name>
							<description>port connection state charge</description>
							<bitRange>[0:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_BC_CTRL</name>
					<description>USB host BC charging control register</description>
					<addressOffset>0x13C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UDM_VSRC_ACT</name>
							<description>In automatic mode, UDP outputs VBC_SRC ,otherwise it is
								controlled by UDM_BC_CMPE							</description>
							<bitRange>[10:10]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UDM_BC_VSRC</name>
							<description>UDM pin BC protocol source voltage enabled</description>
							<bitRange>[9:9]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UDP_BC_VSRC</name>
							<description>UDP pin BC protocol source voltage enabled</description>
							<bitRange>[8:8]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_BC_AUTO_MODE</name>
							<description>Automatic mode enables</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UDM_BC_CMPE</name>
							<description>UDM pin BC protocol comparator enables</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UDP_BC_CMPE</name>
							<description>UDP pin BC protocol comparator enables</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UDM_BC_CMPO</name>
							<description>UDM pin BC protocol comparator status</description>
							<bitRange>[1:1]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UDP_BC_CMPO</name>
							<description>UDP pin BC protocol comparator status</description>
							<bitRange>[0:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>CAN1</name>
			<description>Controller area network</description>
			<groupName>CAN</groupName>
			<baseAddress>0x40006400</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x200</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CAN1_TX</name>
				<description>CAN TX interrupts</description>
				<value>59</value>
			</interrupt>
			<interrupt>
				<name>CAN1_RX0</name>
				<description>CAN RX0 interrupts</description>
				<value>60</value>
			</interrupt>
			<interrupt>
				<name>CAN1_RX1</name>
				<description>CAN RX0 interrupts</description>
				<value>60</value>
			</interrupt>
			<interrupt>
				<name>CAN1_SCE</name>
				<description>CAN SCE interrupt</description>
				<value>58</value>
			</interrupt>
			<registers>
				<register>
					<name>CTLR</name>
					<displayName>CTLR</displayName>
					<description>CAN Master control register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00010002</resetValue>
					<fields>
						<field>
							<name>CFGCANM</name>
							<description>Configure CAN offline recovery time</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DBF</name>
							<description>Debug freeze</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RST</name>
							<description>Software master reset</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TTCM</name>
							<description>Time triggered communication mode</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ABOM</name>
							<description>Automatic bus-off management</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AWUM</name>
							<description>Automatic wakeup mode</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NART</name>
							<description>No automatic retransmission</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RFLM</name>
							<description>Receive FIFO locked mode</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXFP</name>
							<description>Transmit FIFO priority</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SLEEP</name>
							<description>Sleep mode request bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INRQ</name>
							<description>Initialization request</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATR</name>
					<displayName>STATR</displayName>
					<description>CAN master status register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<resetValue>0x0000C002</resetValue>
					<fields>
						<field>
							<name>RX</name>
							<description>Rx signal</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SAMP</name>
							<description>Last sample point</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXM</name>
							<description>Receive mode</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TXM</name>
							<description>Transmit mode</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SLAKI</name>
							<description>Sleep acknowledge interrupt</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WKUI</name>
							<description>Wakeup interrupt</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ERRI</name>
							<description>Error interrupt</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SLAK</name>
							<description>Sleep acknowledge</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INAK</name>
							<description>Initialization acknowledge</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSTATR</name>
					<displayName>TSTATR</displayName>
					<description>CAN transmit status register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<resetValue>0x1C000000</resetValue>
					<fields>
						<field>
							<name>LOW2</name>
							<description>Lowest priority flag for mailbox2</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LOW1</name>
							<description>Lowest priority flag for mailbox1</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LOW0</name>
							<description>Lowest priority flag for mailbox0</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TME2</name>
							<description>Transmit mailbox 2 empty</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TME1</name>
							<description>Transmit mailbox 1 empty</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TME0</name>
							<description>Transmit mailbox 0 empty</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CODE</name>
							<description>Mailbox code</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ABRQ2</name>
							<description>Abort request for mailbox 2</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TERR2</name>
							<description>Transmission error of mailbox 2</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ALST2</name>
							<description>Arbitration lost for mailbox 2</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXOK2</name>
							<description>Transmission OK of mailbox 2</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RQCP2</name>
							<description>Request completed mailbox2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ABRQ1</name>
							<description>Abort request for mailbox 1</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TERR1</name>
							<description>Transmission error of mailbox1</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ALST1</name>
							<description>Arbitration lost for mailbox1</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXOK1</name>
							<description>Transmission OK of mailbox1</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RQCP1</name>
							<description>Request completed mailbox1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ABRQ0</name>
							<description>Abort request for mailbox0</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TERR0</name>
							<description>Transmission error of mailbox0</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ALST0</name>
							<description>Arbitration lost for mailbox0</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXOK0</name>
							<description>Transmission OK of mailbox0</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RQCP0</name>
							<description>Request completed mailbox0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RFIFO0</name>
					<displayName>RFIFO0</displayName>
					<description>CAN receive FIFO 0 register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RFOM0</name>
							<description>Release FIFO 0 output mailbox</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FOVR0</name>
							<description>FIFO 0 overrun</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FULL0</name>
							<description>FIFO 0 full</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FMP0</name>
							<description>FIFO 0 message pending</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RFIFO1</name>
					<displayName>RFIFO1</displayName>
					<description>CAN receive FIFO 1 register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RFOM1</name>
							<description>Release FIFO 1 output mailbox</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FOVR1</name>
							<description>FIFO 1 overrun</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FULL1</name>
							<description>FIFO 1 full</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FMP1</name>
							<description>FIFO 1 message pending</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>INTENR</name>
					<displayName>INTENR</displayName>
					<description>CAN interrupt enable register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SLKIE</name>
							<description>Sleep interrupt 
              enable							</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WKUIE</name>
							<description>Wakeup interrupt 
              enable							</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ERRIE</name>
							<description>Error interrupt 
              enable							</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LECIE</name>
							<description>Last error code interrupt 
              enable							</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BOFIE</name>
							<description>Bus-off interrupt 
              enable							</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EPVIE</name>
							<description>Error passive interrupt 
              enable							</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EWGIE</name>
							<description>Error warning interrupt 
              enable							</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FOVIE1</name>
							<description>FIFO overrun interrupt 
              enable							</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FFIE1</name>
							<description>FIFO full interrupt 
              enable							</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FMPIE1</name>
							<description>FIFO message pending interrupt 
              enable							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FOVIE0</name>
							<description>FIFO overrun interrupt 
              enable							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FFIE0</name>
							<description>FIFO full interrupt 
              enable							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FMPIE0</name>
							<description>FIFO message pending interrupt 
              enable							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TMEIE</name>
							<description>Transmit mailbox empty interrupt 
              enable							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRSR</name>
					<displayName>ERRSR</displayName>
					<description>CAN error status register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>REC</name>
							<description>Receive error counter</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TEC</name>
							<description>Least significant byte of the 9-bit
              transmit error counter							</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LEC</name>
							<description>Last error code</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BOFF</name>
							<description>Bus-off flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EPVF</name>
							<description>Error passive flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EWGF</name>
							<description>Error warning 
              flag							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BTIMR</name>
					<displayName>BTIMR</displayName>
					<description>CAN bit timing register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x01230000</resetValue>
					<fields>
						<field>
							<name>SILM</name>
							<description>Silent mode (debug)</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LBKM</name>
							<description>Loop back mode (debug)</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SJW</name>
							<description>Resynchronization jump width</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TS2</name>
							<description>Time segment 2</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TS1</name>
							<description>Time segment 1</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BTR_TS1_T</name>
							<description>CLAS_LONG_TS1=0;TS1 is TS[3:0](4bit);CLAS_LONG_TS1=1,TS1 is 
			  TS[1:0]+BTR_TS1_T[15:12](6bit)							</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BRP</name>
							<description>minimum time unit length setting value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
