Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="CAN2">
			<name>CAN3</name>
			<baseAddress>0x40007800</baseAddress>
			<interrupt>
				<name>CAN3_TX</name>
				<description>CAN TX interrupts</description>
				<value>137</value>
			</interrupt>
			<interrupt>
				<name>CAN3_RX0</name>
				<description>CAN RX0 interrupts</description>
				<value>138</value>
			</interrupt>
			<interrupt>
				<name>CAN3_RX1</name>
				<description>CAN RX1 interrupts</description>
				<value>139</value>
			</interrupt>
			<interrupt>
				<name>CAN3_SCE</name>
				<description>CAN SCE interrupt</description>
				<value>136</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>DVP</name>
			<description>Digital Video Port</description>
			<groupName>DVP</groupName>
			<baseAddress>0x40025800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>DVP</name>
				<description>DVP global Interrupt 
        interrupt				</description>
				<value>120</value>
			</interrupt>
			<registers>
				<register>
					<name>CR0</name>
					<displayName>CR0</displayName>
					<description>Digital Video control register
			(DVP_CR0)					</description>
					<addressOffset>0x00</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_DVP_ENABLE</name>
							<description>DVP enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_DVP_V_POLAR</name>
							<description>DVP VSYNC polarity control</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_DVP_H_POLAR</name>
							<description>DVP HSYNC polarity control</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_DVP_P_POLAR</name>
							<description>DVP PCLK polarity control</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_DVP_MSK_DAT_MOD</name>
							<description>DVP data mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>RB_DVP_JPEG</name>
							<description>DVP JPEG mode</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CR1</name>
					<displayName>CR1</displayName>
					<description>Digital Video control register
			(DVP_CR1)					</description>
					<addressOffset>0x01</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x06</resetValue>
					<fields>
						<field>
							<name>RB_DVP_DMA_ENABLE</name>
							<description>DVP dma enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_DVP_ALL_CLR</name>
							<description>DVP all clear</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_DVP_RCV_CLR</name>
							<description>DVP receive logic clear</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_DVP_BUF_TOG</name>
							<description>DVP bug toggle by software</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_DVP_CM</name>
							<description>DVP capture mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_DVP_CROP</name>
							<description>DVP Crop feature enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_DVP_FCRC</name>
							<description>DVP frame capture rate control</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IER</name>
					<displayName>IER</displayName>
					<description>Digital Video Interrupt register
			(DVP_IER)					</description>
					<addressOffset>0x02</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_DVP_IE_STR_FRM</name>
							<description>DVP frame start interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_DVP_IE_ROW_DONE</name>
							<description>DVP row received done interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_DVP_IE_FRM_DONE</name>
							<description>DVP frame received done interrupt enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_DVP_IE_FIFO_OV</name>
							<description>DVP receive fifo overflow interrupt enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_DVP_IE_STP_FRM</name>
							<description>DVP frame stop interrupt enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ROW_NUM</name>
					<displayName>ROW_NUM</displayName>
					<description>Image line count configuration register
			(DVP_ROW_NUM)					</description>
					<addressOffset>0x04</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RB_DVP_ROW_NUM</name>
							<description>The number of rows of frame image data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>COL_NUM</name>
					<displayName>COL_NUM</displayName>
					<description>Image column number configuration register
			(DVP_COL_NUM)					</description>
					<addressOffset>0x06</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RB_DVP_COL_NUM</name>
							<description>Number of PCLK cycles for row data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMA_BUF0</name>
					<displayName>DMA_BUF0</displayName>
					<description>Digital Video DMA address register
			(DVP_DMA_BUF0)					</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_DVP_DMA_BUF0</name>
							<description>DMA receive address 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMA_BUF1</name>
					<displayName>DMA_BUF1</displayName>
					<description>Digital Video DMA address register
			(DVP_DMA_BUF1)					</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_DVP_DMA_BUF1</name>
							<description>DMA receive address 1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFR</name>
					<displayName>IFR</displayName>
					<description>Digital Video Flag register
			(DVP_IFR)					</description>
					<addressOffset>0x10</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_DVP_IF_STR_FRM</name>
							<description>DVP frame start interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_DVP_IF_ROW_DONE</name>
							<description>DVP row received done interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_DVP_IF_FRM_DONE</name>
							<description>DVP frame received done interrupt enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_DVP_IF_FIFO_OV</name>
							<description>DVP receive fifo overflow interrupt enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_DVP_IF_STP_FRM</name>
							<description>DVP frame stop interrupt enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<displayName>STATUS</displayName>
					<description>Digital Video STATUS register
		(DVP_STATUS)					</description>
					<addressOffset>0x11</addressOffset>
					<size>0x08</size>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_DVP_FIFO_RDY</name>
							<description>DVP frame start interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_DVP_FIFO_FULL</name>
							<description>DVP row received done interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_DVP_FIFO_OV</name>
							<description>DVP frame received done interrupt enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_DVP_MSK_FIFO_CNT</name>
							<description>DVP receive fifo overflow interrupt enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ROW_CNT</name>
					<displayName>ROW_CNT</displayName>
					<description>Digital Video line counter register
			(DVP_ROW_CNT)					</description>
					<addressOffset>0x14</addressOffset>
					<size>0x10</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RB_DVP_ROW_CNT</name>
							<description>The number of rows of frame image data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HOFFCNT</name>
					<displayName>HOFFCNT</displayName>
					<description>Digital Video horizontal displacement register
			(DVP_HOFFCNT)					</description>
					<addressOffset>0x18</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RB_DVP_HOFFCNT</name>
							<description>Number of PCLK cycles for row data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VST</name>
					<displayName>VST</displayName>
					<description>Digital Video line number register
			(DVP_VST)					</description>
					<addressOffset>0x1A</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RB_DVP_VST</name>
							<description>The number of lines captured by the image</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAPCNT</name>
					<displayName>CAPCNT</displayName>
					<description>Digital Video Capture count register
			(DVP_CAPCNT)					</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RB_DVP_CAPCNT</name>
							<description>Number of PCLK cycles captured by clipping window</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VLINE</name>
					<displayName>VLINE</displayName>
					<description>Digital Video Vertical line count register
			(DVP_VLINE)					</description>
					<addressOffset>0x1E</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RB_DVP_VLINE</name>
							<description>Crop the number of rows captured by window</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DR</name>
					<displayName>DR</displayName>
					<description>Digital Video Data register
			(DVP_DR)					</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_DVP_DR</name>
							<description>Prevent DMA overflow</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
