Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup.svd
				<register>
					<name>SERDES2_RTX_CTRL</name>
					<displayName>SERDES2_RTX_CTRL</displayName>
					<description>SERDESx Transceiver Controller</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BUF_MODE</name>
							<description>Double-buffered control bit</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TX_VLD</name>
							<description>The sent packet is valid, zeroed by the software, and the bit is returned and synchronized with the PHY_CLK</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LINK_INIT</name>
							<description>This bit is 1 and sends a LINK initialization packet</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SERDES_TX_LEN</name>
							<description>Number of data bytes sent, the lower 2 bits are fixed at 0 (4-byte aligned)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SERDES2_RX_LEN0</name>
					<displayName>SERDES2_RX_LEN0</displayName>
					<description>SERDESx Receive Length 0 Register</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SERDES_RX_LEN0</name>
							<description>The packet length of the last received data, with the lowest 2 digits fixed at 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SERDES2_DATA0</name>
					<displayName>SERDES2_DATA0</displayName>
					<description>SERDESx Data 0 Buffer Register</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SERDES_DATA0</name>
							<description>SERDES data buffer 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SERDES2_DMA0</name>
					<displayName>SERDES1_DMA0</displayName>
					<description>Start address register</description>
					<addressOffset>0x58</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SERDES_DMA0</name>
							<description>Buffer 0 start address, in receive mode, 
			  the software needs to align the lower 4 fixed bits 0 (16 bytes),
			  and in send mode, it does not need to align 16 bytes							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SERDES2_RX_LEN1</name>
					<displayName>SERDES2_RX_LEN1</displayName>
					<description>SERDESx Receive Length 1 Register</description>
					<addressOffset>0x5C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SERDES_RX_LEN1</name>
							<description>The packet length of the last received data, with the lowest 2 digits fixed at 1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SERDES2_DATA1</name>
					<displayName>SERDES2_DATA1</displayName>
					<description>SERDESx Data 1 Buffer Register</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SERDES_DATA1</name>
							<description>SERDES data buffer 1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SERDES2_DMA1</name>
					<displayName>SERDES1_DMA1</displayName>
					<description>Start address register</description>
					<addressOffset>0x64</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SERDES_DMA1</name>
							<description>Buffer 0 start address, in receive mode, 
			  the software needs to align the lower 4 fixed bits 0 (16 bytes),
			  and in send mode, it does not need to align 16 bytes							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>USBSS</name>
			<description>USB3.0 ultra-high speed host /device controller</description>
			<groupName>USBSS</groupName>
			<baseAddress>0x40034000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>USBSS</name>
				<description>USBSS global interrupt</description>
				<value>62</value>
			</interrupt>
			<interrupt>
				<name>USBSS_LINK</name>
				<description>USBSS LINK interrupt</description>
				<value>63</value>
			</interrupt>
			<interrupt>
				<name>USBSSWakeUP</name>
				<description>USBSS wake-up interrupt</description>
				<value>65</value>
			</interrupt>
			<registers>
				<register>
					<name>R32_USBSS_CTRL</name>
					<description>USBSS Control Register</description>
					<addressOffset>0x70</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000006</resetValue>
					<fields>
						<field>
							<name>RB_DEV_ADDR</name>
							<description>Host Mode</description>
							<bitRange>[30:24]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UIE_FIFO_RXOV</name>
							<description>Receive FIFO overflow interrupt enabled</description>
							<bitRange>[23:23]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UIE_FIFO_TXOV</name>
							<description>Sending FIFO overflow interrupt enables</description>
							<bitRange>[22:22]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UIE_ITP</name>
							<description>Send ITP to complete interrupt enable</description>
							<bitRange>[20:20]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UIE_RX_PING</name>
							<description>Interrupt Enabled for Receiving PING-TP</description>
							<bitRange>[19:19]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UDIE_STATUS__RB_UHIE_NOTIF</name>
							<description>Device mode: Receiving STATUS transaction completion interrupt enabled;
							Host mode: Interrupt enabled for receiving DEV_NOTIF-TP							</description>
							<bitRange>[18:18]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UDIE_SETUP__RB_UHIE_ERDY</name>
							<description>Device Mode: Receive SETUP Transaction Completion Interrupt Enabled;
							Host mode:Receive SETUP Transaction Completion Interrupt Enabled							</description>
							<bitRange>[17:17]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UIE_TRANSFER</name>
							<description>USB Transaction Completion Interrupt Enabled</description>
							<bitRange>[16:16]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_TX_ERDY_MODE</name>
							<description>Use in device mode</description>
							<bitRange>[14:14]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_REG_HP_PEND</name>
							<description>Packet Pending control bit for sending TP/DP packets</description>
							<bitRange>[9:8]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_HOST_MODE</name>
							<description>USB Operating Mode Selection Bits</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_ITP_EN</name>
							<description>In host mode, send ITP enabled</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_SETUP_FLOW</name>
							<description>SETUP transaction throttling</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_DMA_MODE</name>
							<description>When DPH is transmitted in bursts, the next packet of data status</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_FORCE_RST</name>
							<description>The protocol layer and FIFO module are reset and need to be cleared by software.</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_USB_CLR_ALL</name>
							<description>Reset all software configuration registers, high validity, software clearance required</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_DMA_EN</name>
							<description>Enable DMA</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>USBSS Status Register</description>
					<addressOffset>0x74</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_HRX_RES</name>
							<description>A reply TP is received from the device back</description>
							<bitRange>[31:30]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_HTX_RES</name>
							<description>Received a reply TP from the device returning</description>
							<bitRange>[23:22]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_HOST_ACK_NUMP</name>
							<description>This bit is invalid for synchronous transmission, and is defined as follows in Control Transfer,
							Block Transfer, and Interrupt Transfer							</description>
							<bitRange>[20:16]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_DIR</name>
							<description>The direction of the endpoint that currently has an interrupt flag for transmission completion,</description>
							<bitRange>[12:12]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_ID</name>
							<description>If multiple endpoints have interrupt flags at the same time, the order of endpoint priority is as follows</description>
							<bitRange>[10:8]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UIF_FIFO_RXOV</name>
							<description>Receive FIFO overflow interrupt flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UIF_FIFO_TXOV</name>
							<description>Send FIFO overflow interrupt flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UIF_ITP</name>
							<description>Send the ITP Complete Interrupt flag</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UIF_RX_PING</name>
							<description>Receive PING-TP Complete Interrupt Flag</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UHIF_NOTIF__RB_UDIF_STATUS</name>
							<description>Host Mode: Receive DEV_NOTIF-TP Complete Interrupt Flag;
							Device Mode: Receive STATUS Transaction Completion Interrupt Flag							</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UHIF_ERDY__RB_UDIF_SETUP</name>
							<description>Host Mode: Receive ERDY-TP Complete Interrupt Flag;
							Device Mode: Receive SETUP Transaction Completion Interrupt Flag							</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UIF_TRANSFER</name>
							<description>USB Transaction Completion Interrupt Flag</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UH_TX_DMA_U3EP0_TX_DMA</name>
					<description>Send buffer address registers</description>
					<addressOffset>0x8C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>U3EP0_TX_DMA</name>
							<description>Host Mode:The start address of the host sending buffer. 
										Device Mode:Endpoint 0 sends the start of the buffer.							</description>
							<bitRange>[31:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UH_RX_DMA_U3EP0_RX_DMA</name>
					<description>Receive buffer address registers</description>
					<addressOffset>0x90</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>U3EP0_RX_DMA</name>
							<description>Host Mode:The start address of the host receiving buffer. 
										Device Mode:Endpoint 0 receives the start of the buffer.							</description>
							<bitRange>[31:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ITP</name>
					<description>Interval Registers for ITP packets in USB</description>
					<addressOffset>0x78</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>REG_ITP_INTERVAL</name>
							<description>Bus interval Counter field in the received ITP.</description>
							<bitRange>[13:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ITP_ADJ</name>
					<description>Interval Adaptive Registers for ITP packets in USB</description>
					<addressOffset>0x7C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ITP_DELTA</name>
							<description>The higher 13-bit delta of the ITS in 
							the ITP received in device mode indicates the time difference from the start of the current 
							ITP packet to the previous bus interval boundary.							</description>
							<bitRange>[20:8]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>ITP_DELAYED</name>
							<description>In device mode, the Delayed bit of Link Control Word in the received ITP is 1 when the ITP is delayed.</description>
							<bitRange>[7:7]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>ITP_ADJ_CR</name>
							<description>In device mode, the Bus Interval Adjustment Control field in the received ITP should be 0 after power-on reset or device disconnection.</description>
							<bitRange>[6:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP_TX_EN</name>
					<description>Endpoint Sends Enable Register</description>
					<addressOffset>0x80</addressOffset>
					<size>0x10</size>
					<resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>RB_EP_TX_EN</name>
							<description>Endpoints 1~15 upload enabled</description>
							<bitRange>[15:1]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP_RX_EN</name>
					<description>Endpoint Receive Enable Register</description>
					<addressOffset>0x82</addressOffset>
					<size>0x10</size>
					<resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_EN</name>
							<description>Endpoints 1~15 downpass enabled</description>
							<bitRange>[15:1]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP0_TX_CTRL</name>
					<description>Endpoint 0 sends control registers</description>
					<addressOffset>0x84</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UIF_EP0_TX_ACT</name>
							<description>The upload transaction is interrupted, the software writes 0 to zero, and the hardware sets 1.</description>
							<bitRange>[31:31]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP0_TX_FLOW</name>
							<description>A sign that completes the NRDY-TP send (answer)</description>
							<bitRange>[25:25]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_EP0_TX_PP</name>
							<description>The PP bit in the received ACK-TP</description>
							<bitRange>[24:24]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_EP0_TX_ERDY</name>
							<description>ERDY received</description>
							<bitRange>[23:23]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP0_TX_RES</name>
							<description>Response to ACK-TP</description>
							<bitRange>[22:21]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP0_TX_SEQ</name>
							<description>The current sequence number of the endpoint,
							which is aotomatically reset after receiving the SETUP transaction							</description>
							<bitRange>[20:16]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP0_TX_LEN</name>
							<description>Endpoint transmits length registers with a maximum value of 512B</description>
							<bitRange>[10:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP0_RX_CTRL</name>
					<description>Endpoint 0 receives control registers</description>
					<addressOffset>0x88</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UIF_EP0_RX_ACT</name>
							<description>Upload the transaction completion interrupt flag, the software writes 0 to zero, and the hardware sets 1</description>
							<bitRange>[31:31]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP0_RX_PP</name>
							<description>PP bits in the received DPH</description>
							<bitRange>[24:24]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_EP0_RX_ERDY</name>
							<description>ERDY received</description>
							<bitRange>[23:23]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP0_RX_RES</name>
							<description>Response to DPH</description>
							<bitRange>[22:21]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP0_RX_SEQ</name>
							<description>The sequence number of the endpoint expects to accept</description>
							<bitRange>[20:16]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP0_RX_LEN</name>
							<description>The endpoint receives the length register</description>
							<bitRange>[10:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP1_TX_CFG</name>
					<description>Endpoint 1 Configuration Register</description>
					<addressOffset>0xC0</addressOffset>
					<size>0x8</size>
					<resetValue>0x86</resetValue>
					<fields>
						<field>
							<name>RB_EP_TX_CHAIN_AUTO</name>
							<description>CHAIN automatically switches modes, and this mode is recommended</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_TX_FIFO_MODE</name>
							<description>If the bit is 1, the current endpoint uses FIFO mode, 
							and the start and end addresses of the FIFO should be configured before the bit is 1.							</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_TX_FIFO_CFG</name>
							<description>Access offset address 0xC~0xF, and the operation object</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_TX_EOB_MODE</name>
							<description>If a short packet is sent, EOB/LPF=0 in ACK-TP;If a short packet is sent, EOB/LPF=1 in ACK-TP</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_TX_ERDY_AUTO</name>
							<description>ERDY automatic mode, the hardware will send ERDY,
							no software control required; It is recommended that the synchronization endpoint zero out this bit.							</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_TX_SEQ_AUTO</name>
							<description>1: It is forbidden to write R16_EPn_ST->EP_SEQ_NUM software;
										0: allows the software to write R16_EPn_ST->EP_SEQ_NUM.							</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_TX_ISO_MODE</name>
							<description>A value of 1 indicates that the current endpoint is a synchronous endpoint</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP1_TX_CR</name>
					<description>Endpoint 1 control register</description>
					<addressOffset>0xC1</addressOffset>
					<size>0x8</size>
					<resetValue>0x10</resetValue>
					<fields>
						<field>
							<name>RB_EP_TX_HALT</name>
							<description>Endpoint Stop, High Validity, Endpoint Stop Answering STALL to DPH.</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_TX_CLR</name>
							<description>Write 1 clears all configuration values and status of the endpoint, except for UEP_CFG.</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_TX_CHAIN_CLR</name>
							<description>Write 1 clears all CHAIN configuration values and statuses</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_TX_ERDY_NUMP</name>
							<description>The nump field of ERDY-TP is sent by the hardware, 
							and the value is generally set to the number of supported bursts. 
							For example, if you support 16 bursts, the value of this field is 16.							</description>
							<bitRange>[4:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP1_TX_SEQ</name>
					<description>Endpoint 1 Serial Number Register</description>
					<addressOffset>0xC2</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_TX_EP_SEQ_NUM</name>
							<description>The current serial number of the endpoint,
							writable in non-SEQ_AUTO mode,
							read-only in SEQ_AUTO mode							</description>
							<bitRange>[4:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
