Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup.svd
				<register>
					<name>UH_TX_DMA_OFS</name>
					<description>Host Transmit Address Offset Register</description>
					<addressOffset>0x94</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000400</resetValue>
					<fields>
						<field>
							<name>RB_UH_TX_DMA_OFS</name>
							<description>After the host sends the DMA, the size of the DMA address offset</description>
							<bitRange>[31:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UH_RX_DMA_OFS</name>
					<description>Host Receive Address Offset Register</description>
					<addressOffset>0x98</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000400</resetValue>
					<fields>
						<field>
							<name>RB_UH_RX_DMA_OFS</name>
							<description>After the host receives it, the DMA's address is offset by a large amount.</description>
							<bitRange>[31:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HOST_RX_NUMP</name>
					<description>The host receives the NUMP register</description>
					<addressOffset>0x9E</addressOffset>
					<size>0x10</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UH_RX_DPP_NUM</name>
							<description>The number of DPPs that have been accepted by the host.</description>
							<bitRange>[15:8]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UH_RX_NUMP</name>
							<description>The number of packets that the host expects to receive, 
							if it is a synchronous transmission, will automatically subtract 1 from the hardware for each packet it receives.							</description>
							<bitRange>[7:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HOST_STATUS</name>
					<description>Host Status Registers</description>
					<addressOffset>0xA0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000100</resetValue>
					<fields>
						<field>
							<name>RB_UH_ITP_PRESAGE</name>
							<description>In host mode, this bit indicates the time when the ITP packet was sent</description>
							<bitRange>[19:18]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UH_RX_ISO_PKT_ERR</name>
							<description>A CRC error was received for the packet (DPP) during synchronous transmission</description>
							<bitRange>[17:17]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UH_RX_EOB_LPF</name>
							<description>This bit represents the EOB/LPF status in the received packet</description>
							<bitRange>[16:16]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UH_RX_ERDY_DIR</name>
							<description>ERDY is received from the device, and the segment represents the direction of the endpoint</description>
							<bitRange>[15:15]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UH_RX_ERDY_NUMP</name>
							<description>ERDY received from the device, 
							which indicates the number of packets that can be sent/received by the device's corresponding endpoint							</description>
							<bitRange>[12:8]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UH_RX_ERDY_EP</name>
							<description>ERDY is received from the device, and the segment represents the endpoint number of the device ERDY</description>
							<bitRange>[7:4]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HOST_TX_FC_STATUS</name>
					<description>The host endpoint sends flow control register</description>
					<addressOffset>0xA4</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>EPx_TX_FC</name>
							<description>The flow control status of the host to send endpoints 1-15.</description>
							<bitRange>[15:1]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HOST_RX_FC_STATUS</name>
					<description>The host endpoint receives the flow control register</description>
					<addressOffset>0xA6</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>EPx_RX_FC</name>
							<description>The flow control status of the host to receiving endpoints 1-15</description>
							<bitRange>[15:1]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TP_RX_DATA0</name>
					<description>DEV_NOTIF-TP Data 0 Register</description>
					<addressOffset>0xA8</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>USB3_NOTIF_DATA0</name>
							<description>After the DEV_NOTIF-TP is received, the HP data is stored in this register</description>
							<bitRange>[31:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TP_RX_DATA1</name>
					<description>DEV_NOTIF-TP Data 1 Register</description>
					<addressOffset>0xAC</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>USB3_NOTIF_DATA1</name>
							<description>After the DEV_NOTIF-TP is received, the HP data is stored in this register</description>
							<bitRange>[31:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TP_RX_DATA2</name>
					<description>DEV_NOTIF-TP Data 2 Register</description>
					<addressOffset>0xB0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>USB3_NOTIF_DATA2</name>
							<description>After the DEV_NOTIF-TP is received, the HP data is stored in this register</description>
							<bitRange>[31:0]</bitRange>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LINK_CFG</name>
					<description>LINK Configuration Register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<resetValue>0xC0000128</resetValue>
					<fields>
						<field>
							<name>RB_LINK_RESET</name>
							<description>LINK reset, including the reset state machine and all interrupt flags, is highly effective</description>
							<bitRange>[31:31]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_LINK_TOUT_MODE</name>
							<description>SPEC configure</description>
							<bitRange>[21:21]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_LINK_U1_PING_EN</name>
							<description>Send PING_FPFS under U1 to enable</description>
							<bitRange>[20:20]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_LINK_U2_ALLOW</name>
							<description>High validity, after receiving the LGO_U2, the response LXU allows to enter the U2 state,
							otherwise after receiving the LGO_U2, the response LXU refuses to enter the U2 state.							</description>
							<bitRange>[17:17]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_LINK_U1_ALLOW</name>
							<description>High validity, after receiving the LGO_U1, the response LAU allows to enter the U1 state, 
							otherwise, after receiving the LGO_U1, the response LXU refuses to enter the U1 state							</description>
							<bitRange>[16:16]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_LINK_LTSSM_MODE</name>
							<description>The link state machine enters DISABLE mode</description>
							<bitRange>[15:15]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_LINK_LOOKBACK_ACT</name>
							<description>It is used in LOOPBACK mode for the LOOPBACK master to control the pattern transmission (the LOOPBACK slave keeps 0),
							and the ACT is a high-level signal that lasts for a period of time.							</description>
							<bitRange>[14:14]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_LINK_LOOPBACK_EN</name>
							<description>The LOOPBACK enable bit is allowed, which is highly active, and can be used with the LOOKBACK enable in TX/RX_TS_CFG [3], 
							both of which are valid before LINK can enter the LOOKBACK mode 
							(used to enable the data loopback and error counting of the LOOPBACK slave, 
							and the LOOPBACK master remains 0).							</description>
							<bitRange>[13:13]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_LINK_U2_DET_EN</name>
							<description>Detection mode of connected devices in U2 state</description>
							<bitRange>[12:12]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_LINK_CP78_SEL</name>
							<description>In Compliance Pattern 7/8, send a length of consecutive 0 or consecutive 1</description>
							<bitRange>[11:10]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_LINK_TX_DEEMPH</name>
							<description>Transmitter de-emphasis control</description>
							<bitRange>[9:8]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_LINK_TX_SWING</name>
							<description>The transmitter signal swing control, low swing power consumption, but affect the transmission distance</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_LINK_RX_EQ_EN</name>
							<description>Receiver equalization enable control, optional protocol specifications</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_LINK_LFPS_RX_PD</name>
							<description>LFPS receive control, this bit is 1 to disable LFPS reception</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_LINK_COMPLIANCE_EN</name>
							<description>POLLING_LFPS timeout is in COMPLIANCE mode</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_LINK_PHY_RESET</name>
							<description>The PIPE interface is reset</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_LINK_SS_PLR_SWAP</name>
							<description>Exchange SSTX and SSRX polarities as follows</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_LINK_RX_TERM_EN</name>
							<description>Receiver Termination Resistance Control</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_LINK_DOWN_MODE</name>
							<description>Peripheral Type</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LINK_CTRL</name>
					<description>LINK control registers</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000013</resetValue>
					<fields>
						<field>
							<name>LINK_RX_TS_CFG</name>
							<description>Received Link Control</description>
							<bitRange>[31:24]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>LINK_TX_TS_CFG</name>
							<description>Send the link configuration of the TS1/TS2 training sequence</description>
							<bitRange>[23:16]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_TX_LGO_U3</name>
							<description>After the bit is valid, the LGO_U3 is transmitted, and the hardware is automatically cleared</description>
							<bitRange>[15:15]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_TX_LGO_U2</name>
							<description>After the bit is valid, the LGO_U2 is sent, the high is active, and the hardware is automatically cleared</description>
							<bitRange>[14:14]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_TX_LGO_U1</name>
							<description>After the bit is valid, the LGO_U1 is sent, the high is active, and the hardware is automatically cleared</description>
							<bitRange>[13:13]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_POLLING_EN</name>
							<description>If the TERM is detected by the SS.RX_DETECT, 
							a POLLING handshake will be performed after the software sets the bit to be valid							</description>
							<bitRange>[12:12]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_REG_ROUT_EN</name>
							<description>Enable the routing function of the HUB, which is highly effective, with registers and no interfaces</description>
							<bitRange>[11:11]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_LUP_LDN_EN</name>
							<description>In the U0 state, if there is no data, whether to send LUP and LDN packets every 10us</description>
							<bitRange>[10:10]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_TX_UX_EXIT</name>
							<description>High validity, hardware automatic zeroing</description>
							<bitRange>[9:9]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_TX_WARM_RST</name>
							<description>High validity, cleared by software. A valid bit will send a warm-reset</description>
							<bitRange>[8:8]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_GO_RX_DET</name>
							<description>Before setting this bit, the PD_MODE should be set to P2 mode, 
							and the LINK should be set to enter the SS.RX_DETECT, 
							and the software will query TERM_PRESENT to know whether there is a connection or whether the connection is disconnected. 
							High effectiveness, automatic clearing.							</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_GO_RECOVERY</name>
							<description>SET THE LINK TO ENTER SS.RECOVERY, 
							WHICH IS HIGHLY EFFECTIVE, AND THE HARDWARE IS AUTOMATICALLY CLEARED.							</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_GO_INACTIVE</name>
							<description>SET THE LINK TO ENTER SS.INACTIVE, 
							WHICH IS HIGHLY VALID, AND THE HARDWARE IS AUTOMATICALLY CLEARED							</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_GO_DISABLED</name>
							<description>SET LINK TO ENTER SS.DISABLED, WHICH IS HIGHLY VALID, 
							AND REQUIRES SOFTWARE TO CLEAR							</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_PD_MODE</name>
							<description>Configure the current power mode of the PHY, corresponding to PO/P1/P2/P3 in the PIPE</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LINK_INT_CTRL</name>
					<description>LINK interrupt enable register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LINK_IE_STATE_CHG</name>
							<description>Link State Machine Change Flag Interrupt Enabled</description>
							<bitRange>[31:31]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_U1_TOUT</name>
							<description>U1 Timeout Interrupt Enabled</description>
							<bitRange>[30:30]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_U2_TOUT</name>
							<description>U2 Timeout Interrupt Enabled</description>
							<bitRange>[29:29]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_UX_FAIL</name>
							<description>UX Conversion Failure Interrupt Enabled</description>
							<bitRange>[28:28]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_TX_WARMRST</name>
							<description>Send warm_reset end interrupt enabled</description>
							<bitRange>[27:27]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_UX_EXIT_FAIL</name>
							<description>Exit UX failed to interrupt enabled</description>
							<bitRange>[26:26]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_RX_LMP_TOUT</name>
							<description>Receive LMP Timeout Interrupt Enabled</description>
							<bitRange>[23:23]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_TX_LMP</name>
							<description>If you successfully enter U0, you can send an HP packet to interrupt enable</description>
							<bitRange>[22:22]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_RX_LMP</name>
							<description>Received Link Command Flag Interrupt Enabled</description>
							<bitRange>[21:21]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_RX_DET</name>
							<description>The link enters the Rx.Detect state and is interrupted</description>
							<bitRange>[20:20]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_LOOPBACK</name>
							<description>The link goes into loopback mode for testing and error isolation interrupt enablement</description>
							<bitRange>[19:19]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_COMPLIANCE</name>
							<description>The link enters the compliance test, 
							and the interrupt is enabled by the compatibility test or the physical layer conformance test							</description>
							<bitRange>[18:18]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_HPBUF_FULL</name>
							<description>BUF sends FIFO full interrupt enable</description>
							<bitRange>[17:17]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_HPBUF_EMPTY</name>
							<description>BUF sends FIFO null interrupt enable</description>
							<bitRange>[16:16]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_HOT_RST</name>
							<description>hot reset, which uses the reset interrupt enable of the TS1/TS2 ordered set</description>
							<bitRange>[15:15]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_U3_WAKEUP</name>
							<description>In the U3 state, the Low Frequency Periodic Signal (LFPS) is received to wake up interrupt enabled</description>
							<bitRange>[14:14]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_WARM_RST</name>
							<description>Warm reset (not connected) interrupt enabled with LPFS</description>
							<bitRange>[13:13]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_UX_EXIT</name>
							<description>Request to exit UX is received Interrupt Enable</description>
							<bitRange>[12:12]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_TXEQ</name>
							<description>LINK enters the POLLING_RXEQ for receiver equalization training interrupt enable</description>
							<bitRange>[11:11]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_TERM_PRES</name>
							<description>LINK enters the RX_DETECT to detect the impedance of the remote receiver trace segment and detect the interrupt enabled</description>
							<bitRange>[10:10]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_UX_REJ</name>
							<description>Transmit LGO_ Ux, receive LXU interrupt enabled that refuses to enter the Ux</description>
							<bitRange>[9:9]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_U3_WK_TOUT</name>
							<description>Interrupt the U3 command when requesting to exit U3 command timeout</description>
							<bitRange>[8:8]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_GO_U0</name>
							<description>LINK is interrupted at U0 to enable the following</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_GO_U1</name>
							<description>LINK is interrupted at U1 to enable the following</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_GO_U2</name>
							<description>LINK is interrupted at U2 and enabled</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_GO_U3</name>
							<description>LINK is enabled when the U3 interrupt is enabled</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_DISABLE</name>
							<description>LINK is disabled, interrupt enabled</description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_INACTIVE</name>
							<description>LINK is enabled on INACTIVE interrupt</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_RECOVERY</name>
							<description>DUE TO ERROR LINK IN RECOVERY INTERRUPTED ENABLED</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>LINK_IE_READY</name>
							<description>LINK is initialized, including two ports before (Header Sequence Number Advertisement) 
							and (RX Headr Buffer Credit Advertisement) interrupt enabled							</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
