Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup.svd
				<register>
					<name>MASK</name>
					<displayName>MASK</displayName>
					<description>SDIO mask register (SDIO_MASK)</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CCRCFAILIE</name>
							<description>Command CRC fail interrupt 
              enable							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DCRCFAILIE</name>
							<description>Data CRC fail interrupt 
              enable							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTIMEOUTIE</name>
							<description>Command timeout interrupt 
              enable							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTIMEOUTIE</name>
							<description>Data timeout interrupt 
              enable							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXUNDERRIE</name>
							<description>Tx FIFO underrun error interrupt 
              enable							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXOVERRIE</name>
							<description>Rx FIFO overrun error interrupt 
              enable							</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMDRENDIE</name>
							<description>Command response received interrupt 
              enable							</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMDSENTIE</name>
							<description>Command sent interrupt 
              enable							</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATAENDIE</name>
							<description>Data end interrupt 
              enable							</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STBITERRIE</name>
							<description>Start bit error interrupt 
              enable							</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBACKENDIE</name>
							<description>Data block end interrupt 
              enable							</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMDACTIE</name>
							<description>Command acting interrupt 
              enable							</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXACTIE</name>
							<description>Data transmit acting interrupt 
              enable							</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXACTIE</name>
							<description>Data receive acting interrupt 
              enable							</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXFIFOHEIE</name>
							<description>Tx FIFO half empty interrupt 
              enable							</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXFIFOHFIE</name>
							<description>Rx FIFO half full interrupt 
              enable							</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXFIFOFIE</name>
							<description>Tx FIFO full interrupt 
              enable							</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXFIFOFIE</name>
							<description>Rx FIFO full interrupt 
              enable							</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXFIFOEIE</name>
							<description>Tx FIFO empty interrupt 
              enable							</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXFIFOEIE</name>
							<description>Rx FIFO empty interrupt 
              enable							</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXDAVLIE</name>
							<description>Data available in Tx FIFO interrupt 
              enable							</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXDAVLIE</name>
							<description>Data available in Rx FIFO interrupt 
              enable							</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDIOITIE</name>
							<description>SDIO mode interrupt received interrupt 
              enable							</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CEATENDIE</name>
							<description>CE-ATA command completion signal received interrupt 
              enable							</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FIFOCNT</name>
					<displayName>FIFOCNT</displayName>
					<description>Bits 23:0 = FIFOCOUNT: Remaining number of
          words to be written to or read from the
          FIFO					</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FIF0COUNT</name>
							<description>Remaining number of words to be written to or read from the 
              FIFO							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DCTRL2</name>
					<displayName>SDIO_DCTRL2</displayName>
					<description>Data control register 2</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SLV_CK_PHASE</name>
							<description>phase selection bit when DATA is output from the mode</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SLV_FORCE_ERR</name>
							<description>in slave mode software forces data block CRC errors</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SLV_MODE</name>
							<description>slave mode enable bit</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RANDOM_LEN_EN</name>
							<description>data block arbirary byte length enable bit</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBLOCKSIZE2</name>
							<description>data block length field of arbirary byte length pattern</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FIFO</name>
					<displayName>FIFO</displayName>
					<description>bits 31:0 = FIFOData: Receive and transmit
          FIFO data					</description>
					<addressOffset>0x80</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FIFODATA</name>
							<description>Receive and transmit FIFO data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
