Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup.svd
				<register>
					<name>I3C_EVR</name>
					<displayName>I3C_EVR</displayName>
					<description>I3C event register</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000003</resetValue>
					<fields>
						<field>
							<name>CFEF</name>
							<description>C-FIFO empty flag (whatever the I3C is acting as master/slave)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TXFEF</name>
							<description>TX-FIFO empty flag (whatever the I3C is acting as master/slave)</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CFNFF</name>
							<description>C-FIFO not full flag (when the I3C is acting as master)</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SFNEF</name>
							<description>S-FIFO not empty flag (when the I3C is acting as master)</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TXFNFF</name>
							<description>TX-FIFO not full flag (whatever the I3C is acting as master/slave)</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXFNEF</name>
							<description>RX-FIFO not empty flag (whatever the I3C is acting as master/slave)</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TXLASTF</name>
							<description>last written data byte/word flag (whatever the I3C is acting as master/slave)</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXLASTF</name>
							<description>last read data byte/word flag (whatever the I3C is acting as master/slave)</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FCF</name>
							<description>frame complete flag (whatever the I3C is acting as master/slave)</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXTGTENDF</name>
							<description>slave-initiated read end flag (when the I3C is acting as master)</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERRF</name>
							<description>flag (whatever the I3C is acting as master/slave)</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IBIF</name>
							<description>IBI flag (when the I3C is acting as master)</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IBIENDF</name>
							<description>IBI end flag (when the I3C is acting as slave)</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRF</name>
							<description>master-role request flag (when the I3C is acting as master)</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRUPDF</name>
							<description>master-role update flag (when the I3C is acting as slave)</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HJF</name>
							<description>hot-join flag (when the I3C is acting as master)</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WKPF</name>
							<description>wakeup/missed start flag (when the I3C is acting as slave)</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GETF</name>
							<description>get flag (when the I3C is acting as slave)</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>STAF</name>
							<description>get status flag (when the I3C is acting as slave)</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DAUPDF</name>
							<description>dynamic address update flag (when the I3C is acting as slave)</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MWLUPDF</name>
							<description>maximum write length update flag (when the I3C is acting as slave)</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MRLUPDF</name>
							<description>maximum read length update flag (when the I3C is acting as slave)</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTF</name>
							<description>reset pattern flag (when the I3C is acting as slave)</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ASUPDF</name>
							<description>activity state update flag (when the I3C is acting as slave)</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INTUPDF</name>
							<description>interrupt/master-role/hot-join update flag (when the I3C is acting as slave)</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DEFF</name>
							<description>DEFTGTS flag (when the I3C is acting as slave)</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GRPF</name>
							<description>group addressing flag (when the I3C is acting as slave)</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_INTENR</name>
					<displayName>I3C_INTENR</displayName>
					<description>I3C interrupt enable register</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CFNFIE</name>
							<description>C-FIFO not full interrupt enable (whatever the I3C is acting as master/slave)</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SFNEIE</name>
							<description>S-FIFO not empty interrupt enable (whatever the I3C is acting as master/slave)</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TXFNFIE</name>
							<description>TX-FIFO not full interrupt enable (whatever the I3C is acting as master/slave)</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXFNEIE</name>
							<description>RX-FIFO not empty interrupt enable (whatever the I3C is acting as master/slave)</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FCIE</name>
							<description>frame complete interrupt enable (whatever the I3C is acting as master/slave)</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXTGTENDIE</name>
							<description>slave-initiated read end interrupt enable (when the I3C is acting as master)</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERRIE</name>
							<description>error interrupt enable (whatever the I3C is acting as master/slave)</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IBIIE</name>
							<description>IBI request interrupt enable (when the I3C is acting as master)</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IBIENDIE</name>
							<description>IBI end interrupt enable (when the I3C is acting as slave)</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRIE</name>
							<description>master-role request interrupt enable (when the I3C is acting as master)</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRUPDIE</name>
							<description>master-role update interrupt enable (when the I3C is acting as slave)</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HJIE</name>
							<description>hot-join interrupt enable (when the I3C is acting as master)</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WKPIE</name>
							<description>wakeup interrupt enable (when the I3C is acting as slave)</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GETIE</name>
							<description>GETxxx CCC interrupt enable (when the I3C is acting as slave)</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>STAIE</name>
							<description>GETSTATUS CCC interrupt enable (when the I3C is acting as slave)</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DAUPDIE</name>
							<description>ENTDAA/RSTDAA/SETNEWDA CCC interrupt enable (when the I3C is acting as slave)</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MWLUPDIE</name>
							<description>SETMWL CCC interrupt enable (when the I3C is acting as slave)</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MRLUPDIE</name>
							<description>SETMRL CCC interrupt enable (when the I3C is acting as slave)</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTIE</name>
							<description>reset pattern interrupt enable (when the I3C is acting as slave)</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ASUPDIE</name>
							<description>ENTASx CCC interrupt enable (when the I3C is acting as slave)</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INTUPDIE</name>
							<description>ENEC/DISEC CCC interrupt enable (when the I3C is acting as slave)</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DEFIE</name>
							<description>DEFTGTS CCC interrupt enable (when the I3C is acting as slave)</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GRPIE</name>
							<description>DEFGRPA CCC interrupt enable (when the I3C is acting as slave)</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_CEVR</name>
					<displayName>I3C_CEVR</displayName>
					<description>I3C clear event register</description>
					<addressOffset>0x58</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CFCF</name>
							<description>clear frame complete flag (whatever the I3C is acting as master/slave)</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CRXTGTENDF</name>
							<description>clear slave-initiated read end flag (when the I3C is acting as master)</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CERRF</name>
							<description>clear error flag (whatever the I3C is acting as master/slave)</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CIBIF</name>
							<description>clear IBI request flag (when the I3C is acting as master)</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CIBIENDF</name>
							<description>clear IBI end flag (when the I3C is acting as slave)</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CCRF</name>
							<description>clear master-role request flag (when the I3C is acting as master)</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CCRUPDF</name>
							<description>clear master-role update flag (when the I3C is acting as slave)</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CHJF</name>
							<description>clear hot-join flag (when the I3C is acting as master)</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CWKPF</name>
							<description>clear wakeup flag (when the I3C is acting as slave)</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CGETF</name>
							<description>clear GETxxx CCC flag (when the I3C is acting as slave)</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CSTAF</name>
							<description>clear GETSTATUS CCC flag (when the I3C is acting as slave)</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CDAUPDF</name>
							<description>clear ENTDAA/RSTDAA/SETNEWDA CCC flag (when the I3C is acting as slave)</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CMWLUPDF</name>
							<description>clear SETMWL CCC flag (when the I3C is acting as slave)</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CMRLUPDF</name>
							<description>clear SETMRL CCC flag (when the I3C is acting as slave)</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CRSTF</name>
							<description>clear reset pattern flag (when the I3C is acting as slave)</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CASUPDF</name>
							<description>clear ENTASx CCC flag (when the I3C is acting as slave)</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CINTUPDF</name>
							<description>clear ENEC/DISEC CCC flag (when the I3C is acting as slave)</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CDEFF</name>
							<description>clear DEFTGTS CCC flag (when the I3C is acting as slave)</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CGRPF</name>
							<description>clear DEFGRPA CCC flag (when the I3C is acting as slave)</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_DEVR0</name>
					<displayName>I3C_DEVR0</displayName>
					<description>I3C own device characteristics register</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DAVAL</name>
							<description>dynamic address is valid (when the I3C is acting as slave)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DA</name>
							<description>7-bit dynamic address</description>
							<bitOffset>1</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IBIEN</name>
							<description>IBI request enable (when the I3C is acting as slave)</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CREN</name>
							<description>master-role request enable (when the I3C is acting as slave)</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HJEN</name>
							<description>hot-join request enable (when the I3C is acting as slave)</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AS</name>
							<description>activity state (when the I3C is acting as slave)</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTACT</name>
							<description>reset action/level on received reset pattern (when the I3C is acting as slave)</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTVAL</name>
							<description>reset action is valid (when the I3C is acting as slave)</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_DEVR1</name>
					<displayName>I3C_DEVR1</displayName>
					<description>I3C device 1 characteristics register</description>
					<addressOffset>0x64</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DA</name>
							<description>assigned I3C dynamic address to slave x (when the I3C is acting as master)</description>
							<bitOffset>1</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IBIACK</name>
							<description>IBI request acknowledge (when the I3C is acting as master)</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CRACK</name>
							<description>master-role request acknowledge (when the I3C is acting as master)</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IBIDEN</name>
							<description>IBI data enable (when the I3C is acting as master)</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SUSP</name>
							<description>suspend/stop I3C transfer on received IBI (when the I3C is acting as master)</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIS</name>
							<description>DA[6:0] write disabled (when the I3C is acting as master)</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_DEVR2</name>
					<displayName>I3C_DEVR2</displayName>
					<description>I3C device 2 characteristics register</description>
					<addressOffset>0x68</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DA</name>
							<description>assigned I3C dynamic address to slave x (when the I3C is acting as master)</description>
							<bitOffset>1</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IBIACK</name>
							<description>IBI request acknowledge (when the I3C is acting as master)</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CRACK</name>
							<description>master-role request acknowledge (when the I3C is acting as master)</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IBIDEN</name>
							<description>IBI data enable (when the I3C is acting as master)</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SUSP</name>
							<description>suspend/stop I3C transfer on received IBI (when the I3C is acting as master)</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIS</name>
							<description>DA[6:0] write disabled (when the I3C is acting as master)</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
