Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup.svd
				<register>
					<name>I3C_DEVR3</name>
					<displayName>I3C_DEVR3</displayName>
					<description>I3C device 3 characteristics register</description>
					<addressOffset>0x6c</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DA</name>
							<description>assigned I3C dynamic address to slave x (when the I3C is acting as master)</description>
							<bitOffset>1</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IBIACK</name>
							<description>IBI request acknowledge (when the I3C is acting as master)</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CRACK</name>
							<description>master-role request acknowledge (when the I3C is acting as master)</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IBIDEN</name>
							<description>IBI data enable (when the I3C is acting as master)</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SUSP</name>
							<description>suspend/stop I3C transfer on received IBI (when the I3C is acting as master)</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIS</name>
							<description>DA[6:0] write disabled (when the I3C is acting as master)</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_DEVR4</name>
					<displayName>I3C_DEVR4</displayName>
					<description>I3C device 4 characteristics register</description>
					<addressOffset>0x70</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DA</name>
							<description>assigned I3C dynamic address to slave x (when the I3C is acting as master)</description>
							<bitOffset>1</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IBIACK</name>
							<description>IBI request acknowledge (when the I3C is acting as master)</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CRACK</name>
							<description>master-role request acknowledge (when the I3C is acting as master)</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IBIDEN</name>
							<description>IBI data enable (when the I3C is acting as master)</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SUSP</name>
							<description>suspend/stop I3C transfer on received IBI (when the I3C is acting as master)</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIS</name>
							<description>DA[6:0] write disabled (when the I3C is acting as master)</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_MAXRLR</name>
					<displayName>I3C_MAXRLR</displayName>
					<description>I3C maximum read length register</description>
					<addressOffset>0x90</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MRL</name>
							<description>maximum data read length (when I3C is acting as slave)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IBIP</name>
							<description>IBI payload data size, in bytes (when I3C is acting as slave)</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_MAXWLR</name>
					<displayName>I3C_MAXWLR</displayName>
					<description>I3C maximum write length register</description>
					<addressOffset>0x94</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MWL</name>
							<description>maximum data write length (when I3C is acting as slave)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_TIMINGR0</name>
					<displayName>I3C_TIMINGR0</displayName>
					<description>I3C timing register 0</description>
					<addressOffset>0xA0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SCLL_PP</name>
							<description>SCL low duration in I3C push-pull phases, in number of kernel clocks cycles</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCLH_I3C</name>
							<description>SCL high duration, used for I3C messages (both in push-pull and open-drain phases), in number of kernel clocks cycles</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCLL_OD</name>
							<description>SCL low duration in open-drain phases, used for legacy I2C commands and for I3C open-drain phases (address header phase following a START, not a Repeated START), in number of kernel clocks cycles</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCLH_I2C</name>
							<description>SCL high duration, used for legacy I2C commands, in number of kernel clocks cycles</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_TIMINGR1</name>
					<displayName>I3C_TIMINGR1</displayName>
					<description>I3C timing register 1</description>
					<addressOffset>0xA4</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AVAL</name>
							<description>number of kernel clock cycles, that is used whatever I3C is acting as controller or slave, to set the following MIPI I3C timings, like bus available condition time:
When the I3C is acting as slave							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ASNCR</name>
							<description>activity state of the new master (when I3C is acting as active- master)</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FREE</name>
							<description>number of kernel clocks cycles that is used to set some MIPI timings like bus free condition time (when the I3C is acting as master)</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDA_HD</name>
							<description>SDA hold time (when the I3C is acting as master), in number of kernel clocks cycles (refer to MIPI timing SDA hold time in push-pull tHD_PP):</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_TIMINGR2</name>
					<displayName>I3C_TIMINGR2</displayName>
					<description>I3C timing register 2</description>
					<addressOffset>0xa8</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>STALLT</name>
							<description>master clock stall on T-bit phase of Data enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STALLD</name>
							<description>master clock stall on PAR phase of Data enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STALLC</name>
							<description>master clock stall on PAR phase of CCC enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STALLA</name>
							<description>master clock stall enable on ACK phase</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STALL</name>
							<description>master clock stall time, in number of kernel clock cycles</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_BCR</name>
					<displayName>I3C_BCR</displayName>
					<description>I3C bus characteristics register</description>
					<addressOffset>0xc0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BCR0</name>
							<description>max data speed limitation</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BCR2</name>
							<description>in-band interrupt (IBI) payload</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BCR6</name>
							<description>master capable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_DCR</name>
					<displayName>I3C_DCR</displayName>
					<description>I3C device characteristics register</description>
					<addressOffset>0xc4</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DCR</name>
							<description>device characteristics ID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_GETCAPR</name>
					<displayName>I3C_GETCAPR</displayName>
					<description>I3C get capability register</description>
					<addressOffset>0xc8</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CAPPEND</name>
							<description>IBI MDB support for pending read notification</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_CRCAPR</name>
					<displayName>I3C_CRCAPR</displayName>
					<description>I3C master-role capability register</description>
					<addressOffset>0xcc</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CAPDHOFF</name>
							<description>delayed master-role hand-off</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPGRP</name>
							<description>group management support (when acting as master)</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_GETMDSR</name>
					<displayName>I3C_GETMDSR</displayName>
					<description>I3C get capability register</description>
					<addressOffset>0xD0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HOFFAS</name>
							<description>master hand-off activity state</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FMT</name>
							<description>GETMXDS CCC format</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RDTURN</name>
							<description>programmed byte of the 3-byte MaxRdTurn (maximum read turnaround byte)</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TSCO</name>
							<description>clock-to-data turnaround time (tSCO)</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I3C_EPIDR</name>
					<displayName>I3C_EPIDR</displayName>
					<description>I3C extended provisioned ID register</description>
					<addressOffset>0xd4</addressOffset>
					<size>0x20</size>
					<resetValue>0x02080000</resetValue>
					<fields>
						<field>
							<name>MIPIID</name>
							<description>4-bit MIPI Instance ID</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IDTSEL</name>
							<description>provisioned ID type selector</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MIPIMID</name>
							<description>15-bit MIPI manufacturer ID</description>
							<bitOffset>17</bitOffset>
							<bitWidth>15</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
