Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>HSADC</name>
			<description>High speed ADC</description>
			<groupName>HSADC</groupName>
			<baseAddress>0x40017400</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>HSADC</name>
				<description>HSADC global interrupt</description>
				<value>144</value>
			</interrupt>
			<registers>
				<register>
					<name>CFGR</name>
					<displayName>CFGR</displayName>
					<description>High-speed ADC configuration register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<resetValue>0x00002400</resetValue>
					<fields>
						<field>
							<name>EN</name>
							<description>High-speed ADC enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMAEN</name>
							<description>Direct Storage Access (DMA) mode enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SETUP</name>
							<description>First Transition Establishment Time Configuration Bit</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PPMODE</name>
							<description>Ping Pong storage mode enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BURST_EN</name>
							<description>DMA transmission length configuration bit</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMA_LEN</name>
							<description>DMA transmission length configuration bit</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CTLR1</name>
					<displayName>CTLR1</displayName>
					<description>HSADC Control Register 1</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>START</name>
							<description>Initiating High-Speed ADC Conversion</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>BURST_END</name>
							<description>Abort a burst transmission</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EOCIE</name>
							<description>Transition Completion Interrupt Enables</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMAIE</name>
							<description>Transition Completion Interrupt Enables</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BURSTIE</name>
							<description>Interrupt enables when the burst transmission is complete</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CTLR2</name>
					<displayName>CTLR2</displayName>
					<description>HSADC Control Register 2</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BURST_LEN</name>
							<description>Burst transmission length configuration</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BURST_DMA_LEN</name>
							<description>The final DMA transmission length configuration bit for burst transmission. 
			  If the number of data transmitted in the final burst is not aligned with the DMA transmission length,
			  the DMA transmission length is configured							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATR</name>
					<displayName>STATR</displayName>
					<description>HSADC Status Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000100</resetValue>
					<fields>
						<field>
							<name>EOCIF</name>
							<description>Transition Complete Interrupt flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMAIF</name>
							<description>DMA Transmission Complete Interrupt flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BURSTIF</name>
							<description>Burst transfer completed interrupt flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RXNE</name>
							<description>The data register is not empty flag, that is, the conversion is completed 
			  and the data is stored in the data register, which is the position bit; 
			  A read operation on the data register clears the bit							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PP_ADDR</name>
							<description>Ping-pong storage mode cache address indicator bit</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FIFO_RDY</name>
							<description>Receives a FIFO non-null status flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FIFO_FULL</name>
							<description>Receive FIFO full status flags</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FIFO_OV</name>
							<description>Receives the FIFO overflow status flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FIFO_CNT</name>
							<description>Receives the FIFO current count value</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DATAR</name>
					<displayName>DATAR</displayName>
					<description>HSADC Data Register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DR</name>
							<description>Convert data register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ADDR0</name>
					<displayName>ADDR0</displayName>
					<description>HSADC DMA Receive Address Register 0</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMA_ADDR0</name>
							<description>The DMA transmission address is configured with the 0 configuration bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ADDR1</name>
					<displayName>ADDR1</displayName>
					<description>HSADC DMA Receive Address Register 1</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMA_ADDR1</name>
							<description>DMA transport address 1 configuration bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
