Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup.svd
				<register>
					<name>L2CKCR</name>
					<displayName>L2CKCR</displayName>
					<description>Layerx Color Keying Configuration
          Register					</description>
					<addressOffset>0x70</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CKRED</name>
							<description>Color Key Red value</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CKGREEN</name>
							<description>Color Key Green value</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CKBLUE</name>
							<description>Color Key Blue value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>L2PFCR</name>
					<displayName>L2PFCR</displayName>
					<description>Layerx Pixel Format Configuration
          Register					</description>
					<addressOffset>0x74</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PF</name>
							<description>Pixel Format</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>L2CACR</name>
					<displayName>L2CACR</displayName>
					<description>Layerx Constant Alpha Configuration
          Register					</description>
					<addressOffset>0x78</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CONSTA</name>
							<description>Constant Alpha</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>L2DCCR</name>
					<displayName>L2DCCR</displayName>
					<description>Layerx Default Color Configuration
          Register					</description>
					<addressOffset>0x7C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DCALPHA</name>
							<description>Default Color Alpha</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>DCRED</name>
							<description>Default Color Red</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>DCGREEN</name>
							<description>Default Color Green</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>DCBLUE</name>
							<description>Default Color Blue</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>L2BFCR</name>
					<displayName>L2BFCR</displayName>
					<description>Layerx Blending Factors Configuration
          Register					</description>
					<addressOffset>0x80</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000600</resetValue>
					<fields>
						<field>
							<name>BF1</name>
							<description>Blending Factor 1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>BF2</name>
							<description>Blending Factor 2</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>L2CFBAR</name>
					<displayName>L2CFBAR</displayName>
					<description>Layerx Color Frame Buffer Address
          Register					</description>
					<addressOffset>0x84</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CFBADD</name>
							<description>Color Frame Buffer Start
              Address							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>L2CFBLR</name>
					<displayName>L2CFBLR</displayName>
					<description>Layerx Color Frame Buffer Length
          Register					</description>
					<addressOffset>0x88</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CFBP</name>
							<description>Color Frame Buffer Pitch in
              bytes							</description>
							<bitOffset>16</bitOffset>
							<bitWidth>13</bitWidth>
						</field>
						<field>
							<name>CFBLL</name>
							<description>Color Frame Buffer Line
              Length							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>L2CFBLNR</name>
					<displayName>L2CFBLNR</displayName>
					<description>Layerx ColorFrame Buffer Line Number
          Register					</description>
					<addressOffset>0x8C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CFBLNBR</name>
							<description>Frame Buffer Line Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>L2CLUTWR</name>
					<displayName>L2CLUTWR</displayName>
					<description>Layerx CLUT Write Register</description>
					<addressOffset>0x90</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CLUTADD</name>
							<description>CLUT Address</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>RED</name>
							<description>Red value</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>GREEN</name>
							<description>Green value</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>BLUE</name>
							<description>Blue value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
