Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>DFSDM</name>
			<description>Digital filter for sigma delta
      modulators			</description>
			<groupName>DFSDM</groupName>
			<baseAddress>0x40017000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>DFSDM0</name>
				<description>DFSDM0 global interrupt</description>
				<value>127</value>
			</interrupt>
			<interrupt>
				<name>DFSDM1</name>
				<description>DFSDM1 global interrupt</description>
				<value>128</value>
			</interrupt>
			<registers>
				<register>
					<name>CH0CFGR1</name>
					<displayName>CH0CFGR1</displayName>
					<description>channel configuration 0
          register					</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>DFSDMEN</name>
							<description>The DFSDM interface is globally enabled</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CKOUTSRC</name>
							<description>Output Serial Clock Source Selection</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CKOUTDIV</name>
							<description>Output Serial Clock Divider</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>DATPACK</name>
							<description>R32_DFSDM_CHyDATINR register data encapsulation mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>DATMPX</name>
							<description>Channel 0 Input Data Multiplexer</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CHINSEL</name>
							<description>Channel Input Selection</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHEN</name>
							<description>Channel 0 enables</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CKABEN</name>
							<description>Channel 0 Clock Missing Detector Enables</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SCDEN</name>
							<description>Channel 0 Short Circuit Detector Enables</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPICKSEL</name>
							<description>Channel 0 SPI Clock Selection</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>SITP</name>
							<description>Channel 0 Serial Interface Type</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH1CFGR1</name>
					<displayName>CH1CFGR1</displayName>
					<description>channel configuration 1
          register					</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>DFSDMEN</name>
							<description>The DFSDM interface is globally enabled</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CKOUTSRC</name>
							<description>Output Serial Clock Source Selection</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CKOUTDIV</name>
							<description>Output Serial Clock Divider</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>DATPACK</name>
							<description>R32_DFSDM_CHyDATINR register data encapsulation mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>DATMPX</name>
							<description>Channel 1 Input Data Multiplexer</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CHINSEL</name>
							<description>Channel Input Selection</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHEN</name>
							<description>Channel 1 enables</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CKABEN</name>
							<description>Channel 1 Clock Missing Detector Enables</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SCDEN</name>
							<description>Channel 1 Short Circuit Detector Enables</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPICKSEL</name>
							<description>Channel 1 SPI Clock Selection</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>SITP</name>
							<description>Channel 1 Serial Interface Type</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH0CFGR2</name>
					<displayName>CH0CFGR2</displayName>
					<description>channel configuration 0
          register					</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>OFFSET</name>
							<description>Channel 0 24-bit calibration offset</description>
							<bitOffset>8</bitOffset>
							<bitWidth>24</bitWidth>
						</field>
						<field>
							<name>DTRBS</name>
							<description>Channel 0 data right shift</description>
							<bitOffset>3</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH1CFGR2</name>
					<displayName>CH1CFGR2</displayName>
					<description>channel configuration 1
          register					</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>OFFSET</name>
							<description>Channel 1 24-bit calibration offset</description>
							<bitOffset>8</bitOffset>
							<bitWidth>24</bitWidth>
						</field>
						<field>
							<name>DTRBS</name>
							<description>Channel 1 data right shift</description>
							<bitOffset>3</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH0AWSCDR</name>
					<displayName>CH0AWSCDR</displayName>
					<description>analog watchdog and short-circuit detector
          register					</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>AWFORD</name>
							<description>Channel 0 analog watchdog Sinc filter order</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>AWFOSR</name>
							<description>Channel 0 analog watchdog filter oversampling rate</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>BKSCD</name>
							<description>Channel 0 Short Circuit Detector Open Signal Distribution</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SCDT</name>
							<description>Short Circuit Detector Threshold for Channel 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH1AWSCDR</name>
					<displayName>CH1AWSCDR</displayName>
					<description>analog watchdog and short-circuit detector
          register					</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>AWFORD</name>
							<description>Channel 1 analog watchdog Sinc filter order</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>AWFOSR</name>
							<description>Channel 1 analog watchdog filter oversampling rate</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>BKSCD</name>
							<description>Channel 1 Short Circuit Detector Open Signal Distribution</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SCDT</name>
							<description>Short Circuit Detector Threshold for Channel 1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH0WDATR</name>
					<displayName>CH0WDATR</displayName>
					<description>channel watchdog filter data
          register					</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Enter channel 0 watchdog data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH1WDATR</name>
					<displayName>CH1WDATR</displayName>
					<description>channel watchdog filter data
          register					</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Enter channel 1 watchdog data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH0DATINR</name>
					<displayName>CH0DATINR</displayName>
					<description>channel data input register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>INDAT1</name>
							<description>Input data for channel y or channel y+1</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>INDAT0</name>
							<description>Channel Y Input Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH1DATINR</name>
					<displayName>CH1DATINR</displayName>
					<description>channel data input register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>INDAT1</name>
							<description>Input data for channel 1 or channel 2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>INDAT0</name>
							<description>Channel 1 Input Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT0CR1</name>
					<displayName>DFSDM_FLT0CR1</displayName>
					<description>control register 1</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AWFSEL</name>
							<description>Analog watchdog fast mode
              select							</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FAST</name>
							<description>Fast conversion mode selection for
              regular conversions							</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RCH</name>
							<description>Regular channel selection</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>RDMAEN</name>
							<description>DMA channel enabled to read data for the
              regular conversion							</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSYNC</name>
							<description>Launch regular conversion synchronously
              with DFSDM0							</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RCONT</name>
							<description>Continuous mode selection for regular
              conversions							</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSWSTART</name>
							<description>Software start of a conversion on the
              regular channel							</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JEXTEN</name>
							<description>Trigger enable and trigger edge
              selection for injected conversions							</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>JEXTSEL</name>
							<description>Trigger signal selection for launching
              injected conversions							</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>JDMAEN</name>
							<description>DMA channel enabled to read data for the
              injected channel group							</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JSCAN</name>
							<description>Scanning conversion mode for injected
              conversions							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JSYNC</name>
							<description>Launch an injected conversion
              synchronously with the DFSDM0 JSWSTART
              trigger							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JSWSTART</name>
							<description>Start a conversion of the injected group
              of channels							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DFEN</name>
							<description>DFSDM enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT0CR2</name>
					<displayName>DFSDM_FLT0CR2</displayName>
					<description>control register 2</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AWDCH</name>
							<description>Analog watchdog channel
              selection							</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>EXCH</name>
							<description>Extremes detector channel
              selection							</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CKABIE</name>
							<description>Clock absence interrupt
              enable							</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SCDIE</name>
							<description>Short-circuit detector interrupt
              enable							</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AWDIE</name>
							<description>Analog watchdog interrupt
              enable							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ROVRIE</name>
							<description>Regular data overrun interrupt
              enable							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JOVRIE</name>
							<description>Injected data overrun interrupt
              enable							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>REOCIE</name>
							<description>Regular end of conversion interrupt
              enable							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JEOCIE</name>
							<description>Injected end of conversion interrupt
              enable							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT0ISR</name>
					<displayName>DFSDM_FLT0ISR</displayName>
					<description>interrupt and status register</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SCDF</name>
							<description>short-circuit detector
              flag							</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CKABF</name>
							<description>Clock absence flag</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>RCIP</name>
							<description>Regular conversion in progress
              status							</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JCIP</name>
							<description>Injected conversion in progress
              status							</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AWDF</name>
							<description>Analog watchdog</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ROVRF</name>
							<description>Regular conversion overrun
              flag							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JOVRF</name>
							<description>Injected conversion overrun
              flag							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>REOCF</name>
							<description>End of regular conversion
              flag							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JEOCF</name>
							<description>End of injected conversion
              flag							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT0ICR</name>
					<displayName>DFSDM_FLT0ICR</displayName>
					<description>interrupt flag clear register</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CLRSCDF</name>
							<description>Clear the short-circuit detector
              flag							</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CLRCKABF</name>
							<description>Clear the clock absence
              flag							</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CLRROVRF</name>
							<description>Clear the regular conversion overrun
              flag							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CLRJOVRF</name>
							<description>Clear the injected conversion overrun
              flag							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT0JCHGR</name>
					<displayName>DFSDM_FLT0JCHGR</displayName>
					<description>injected channel group selection
          register					</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>JCHG</name>
							<description>Injected channel group
              selection							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT0FCR3</name>
					<displayName>FLT0FCR3</displayName>
					<description>control register 3</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FORD</name>
							<description>Sinc Filter Order</description>
							<bitOffset>29</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FOSR</name>
							<description>Sinc filter oversampling rate</description>
							<bitOffset>16</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IOSR</name>
							<description>The integrator oversampling rate is 2 to the power of IOSR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT0JDATAR</name>
					<displayName>DFSDM_FLT0JDATAR</displayName>
					<description>data register for injected
          group					</description>
					<addressOffset>0x58</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>JDATA</name>
							<description>Injected group conversion
              data							</description>
							<bitOffset>8</bitOffset>
							<bitWidth>24</bitWidth>
						</field>
						<field>
							<name>JDATACH</name>
							<description>Injected channel most recently
              converted							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DFSDM_FLT0RDATAR</name>
					<displayName>DFSDM_FLT0RDATAR</displayName>
					<description>data register for the regular
          channel					</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RDATA</name>
							<description>Regular channel conversion
              data							</description>
							<bitOffset>8</bitOffset>
							<bitWidth>24</bitWidth>
						</field>
						<field>
							<name>RPEND</name>
							<description>Regular channel pending
              data							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RDATACH</name>
							<description>Regular channel most recently
              converted							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
