Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup.svd
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>This register contains information about the
          FIFO status and interrupt					</description>
					<addressOffset>0x84</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000040</resetValue>
					<fields>
						<field>
							<name>IRS</name>
							<description>Interrupt rising edge status</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ILS</name>
							<description>Interrupt high-level status</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IFS</name>
							<description>Interrupt falling edge status</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IREN</name>
							<description>Interrupt rising edge detection enable
              bit							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ILEN</name>
							<description>Interrupt high-level detection enable
              bit							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IFEN</name>
							<description>Interrupt falling edge detection enable
              bit							</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEMPT</name>
							<description>FIFO empty</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMEM</name>
					<displayName>PMEM</displayName>
					<description>The FMC_PMEM read/write register contains
          the timing information for NAND Flash memory bank					</description>
					<addressOffset>0x88</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFCFCFCFC</resetValue>
					<fields>
						<field>
							<name>MEMSET</name>
							<description>Common memory x setup time</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>MEMWAIT</name>
							<description>Common memory wait time</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>MEMHOLD</name>
							<description>Common memory hold time</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>MEMHIZ</name>
							<description>Common memory x data bus Hi-Z time</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PATT</name>
					<displayName>PATT</displayName>
					<description>The FMC_PATT read/write register contains
          the timing information for NAND Flash memory bank					</description>
					<addressOffset>0x8C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFCFCFCFC</resetValue>
					<fields>
						<field>
							<name>ATTSET</name>
							<description>Attribute memory setup time</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>ATTWAIT</name>
							<description>Attribute memory wait time</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>ATTHOLD</name>
							<description>Attribute memory hold time</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>ATTHIZ</name>
							<description>Attribute memory data bus Hi-Z time</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ECCR</name>
					<displayName>ECCR</displayName>
					<description>This register contain the current error
          correction code value computed by the ECC computation
          modules of the FMC NAND controller					</description>
					<addressOffset>0x94</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ECC</name>
							<description>ECC result This field contains the value
              computed by the ECC computation logic. Table167
              describes the contents of these bit
              fields.							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BWTR1</name>
					<displayName>BWTR1</displayName>
					<description>This register contains the control
          information of each memory bank. It is used for SRAMs,
          PSRAMs and NOR Flash memories.					</description>
					<addressOffset>0x104</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0FFFFFFF</resetValue>
					<fields>
						<field>
							<name>ADDSET</name>
							<description>Address setup phase duration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ADDHLD</name>
							<description>Address-hold phase duration</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DATAST</name>
							<description>Data-phase duration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>BUSTURN</name>
							<description>Bus turnaround phase duration</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ACCMOD</name>
							<description>Access mode</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BWTR2</name>
					<displayName>BWTR2</displayName>
					<description>This register contains the control
          information of each memory bank. It is used for SRAMs,
          PSRAMs and NOR Flash memories.					</description>
					<addressOffset>0x10C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0FFFFFFF</resetValue>
					<fields>
						<field>
							<name>ADDSET</name>
							<description>Address setup phase duration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ADDHLD</name>
							<description>Address-hold phase duration</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DATAST</name>
							<description>Data-phase duration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>BUSTURN</name>
							<description>Bus turnaround phase duration</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ACCMOD</name>
							<description>Access mode</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BWTR3</name>
					<displayName>BWTR3</displayName>
					<description>This register contains the control
          information of each memory bank. It is used for SRAMs,
          PSRAMs and NOR Flash memories.					</description>
					<addressOffset>0x114</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0FFFFFFF</resetValue>
					<fields>
						<field>
							<name>ADDSET</name>
							<description>Address setup phase duration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ADDHLD</name>
							<description>Address-hold phase duration</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DATAST</name>
							<description>Data-phase duration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>BUSTURN</name>
							<description>Bus turnaround phase duration</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ACCMOD</name>
							<description>Access mode</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BWTR4</name>
					<displayName>BWTR4</displayName>
					<description>This register contains the control
          information of each memory bank. It is used for SRAMs,
          PSRAMs and NOR Flash memories.					</description>
					<addressOffset>0x11C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0FFFFFFF</resetValue>
					<fields>
						<field>
							<name>ADDSET</name>
							<description>Address setup phase duration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ADDHLD</name>
							<description>Address-hold phase duration</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DATAST</name>
							<description>Data-phase duration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>BUSTURN</name>
							<description>Bus turnaround phase duration</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ACCMOD</name>
							<description>Access mode</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SDCR1</name>
					<displayName>SDCR1</displayName>
					<description>This register contains the control
          parameters for each SDRAM memory bank					</description>
					<addressOffset>0x140</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000002D0</resetValue>
					<fields>
						<field>
							<name>NC</name>
							<description>Number of column address bits These bits
              define the number of bits of a column
              address.							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>NR</name>
							<description>Number of row address bits These bits
              define the number of bits of a row
              address.							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MWID</name>
							<description>Memory data bus width. These bits define
              the memory device width.							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>NB</name>
							<description>Number of internal banks This bit sets
              the number of internal banks.							</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CAS</name>
							<description>CAS Latency This bits sets the SDRAM CAS
              latency in number of memory clock
              cycles							</description>
							<bitOffset>7</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>WP</name>
							<description>Write protection This bit enables write
              mode access to the SDRAM bank.							</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDCLK</name>
							<description>SDRAM clock configuration</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>RBURST</name>
							<description>Burst read</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RPIPE</name>
							<description>Read pipe</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SDCR2</name>
					<displayName>SDCR2</displayName>
					<description>This register contains the control
          parameters for each SDRAM memory bank					</description>
					<addressOffset>0x144</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000002D0</resetValue>
					<fields>
						<field>
							<name>NC</name>
							<description>Number of column address bits These bits
              define the number of bits of a column
              address.							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>NR</name>
							<description>Number of row address bits These bits
              define the number of bits of a row
              address.							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MWID</name>
							<description>Memory data bus width. These bits define
              the memory device width.							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>NB</name>
							<description>Number of internal banks This bit sets
              the number of internal banks.							</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CAS</name>
							<description>CAS Latency This bits sets the SDRAM CAS
              latency in number of memory clock
              cycles							</description>
							<bitOffset>7</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>WP</name>
							<description>Write protection This bit enables write
              mode access to the SDRAM bank.							</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDCLK</name>
							<description>SDRAM clock configuration</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>RBURST</name>
							<description>Burst read</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RPIPE</name>
							<description>Read pipe</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SDTR1</name>
					<displayName>SDTR1</displayName>
					<description>This register contains the timing parameters
          of each SDRAM bank					</description>
					<addressOffset>0x148</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0FFFFFFF</resetValue>
					<fields>
						<field>
							<name>TMRD</name>
							<description>Load Mode Register to Active</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>TXSR</name>
							<description>Exit Self-refresh delay</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>TRAS</name>
							<description>Self refresh time</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>TRC</name>
							<description>Row cycle delay</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>TWR</name>
							<description>Recovery delay</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>TRP</name>
							<description>Row precharge delay</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>TRCD</name>
							<description>Row to column delay</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SDTR2</name>
					<displayName>SDTR2</displayName>
					<description>This register contains the timing parameters
          of each SDRAM bank					</description>
					<addressOffset>0x14C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0FFFFFFF</resetValue>
					<fields>
						<field>
							<name>TMRD</name>
							<description>Load Mode Register to Active</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>TXSR</name>
							<description>Exit Self-refresh delay</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>TRAS</name>
							<description>Self refresh time</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>TRC</name>
							<description>Row cycle delay</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>TWR</name>
							<description>Recovery delay</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>TRP</name>
							<description>Row precharge delay</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>TRCD</name>
							<description>Row to column delay</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SDCMR</name>
					<displayName>SDCMR</displayName>
					<description>This register contains the command issued
          when the SDRAM device is accessed					</description>
					<addressOffset>0x150</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MODE</name>
							<description>Command mode These bits define the
              command issued to the SDRAM device.							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>CTB2</name>
							<description>Command Target Bank 2 This bit indicates
              whether the command will be issued to SDRAM Bank 2 or
              not.							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CTB1</name>
							<description>Command Target Bank 1 This bit indicates
              whether the command will be issued to SDRAM Bank 1 or
              not.							</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NRFS</name>
							<description>Number of Auto-refresh</description>
							<bitOffset>5</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>MRD</name>
							<description>Mode Register definition</description>
							<bitOffset>9</bitOffset>
							<bitWidth>14</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SDRTR</name>
					<displayName>SDRTR</displayName>
					<description>This register sets the refresh rate in
          number of SDCLK clock cycles between the refresh cycles
          by configuring the Refresh Timer Count value					</description>
					<addressOffset>0x154</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CRE</name>
							<description>Clear Refresh error flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>COUNT</name>
							<description>Refresh Timer Count</description>
							<bitOffset>1</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REIE</name>
							<description>RES Interrupt Enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SDSR</name>
					<displayName>SDSR</displayName>
					<description>SDRAM Status register</description>
					<addressOffset>0x158</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RE</name>
							<description>Refresh error flag An interrupt is
              generated if REIE = 1 and RE = 1							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MODES1</name>
							<description>Status Mode for Bank 1 These bits define
              the Status Mode of SDRAM Bank 1.							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODES2</name>
							<description>Status Mode for Bank 2 These bits define
              the Status Mode of SDRAM Bank 2.							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>BUSY</name>
							<description>BUSY</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MISC</name>
					<displayName>MISC</displayName>
					<description>SDRAM custom registers</description>
					<addressOffset>0x180</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>NRFS_CNT</name>
							<description>Define the number of times the controller self-refreshes each time</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>Phase_Sel</name>
							<description>Phase offset of the output SDR_CLK</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>Enhance_read_mode</name>
							<description>Read enhancement/prefetch mode</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>En_Bank1</name>
							<description>Enable SDRAM1</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>En_Bank2</name>
							<description>Enable SDRAM2</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
