Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ETHERNET_DMA</name>
			<description>Ethernet: DMA controller operation</description>
			<groupName>ETHERNET</groupName>
			<baseAddress>0x40029000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DMABMR</name>
					<displayName>DMABMR</displayName>
					<description>Ethernet DMA bus mode register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>SR</name>
							<description>Software reset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DSL</name>
							<description>Descriptor skip length</description>
							<bitOffset>2</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>DFM</name>
							<description>Descriptor mode</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ERX_RST</name>
							<description>MAC receive reset control</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETX_RST</name>
							<description>MAC sent reset control</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMARX_RST</name>
							<description>DMA receive reset control</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMATX_RST</name>
							<description>DMA sent reset control</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DMATPDR</name>
					<displayName>DMATPDR</displayName>
					<description>Ethernet DMA transmit poll demand
          register					</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TPD</name>
							<description>Transmit poll demand</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DMARPDR</name>
					<displayName>DMARPDR</displayName>
					<description>EHERNET DMA receive poll demand
          register					</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RPD</name>
							<description>Receive poll demand</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DMARDLAR</name>
					<displayName>DMARDLAR</displayName>
					<description>Ethernet DMA receive descriptor list address
          register					</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RDLAR</name>
							<description>Start of receive list</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DMATDLAR</name>
					<displayName>DMATDLAR</displayName>
					<description>Ethernet DMA transmit descriptor list
          address register					</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TDLAR</name>
							<description>Start of transmit list</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DMASR</name>
					<displayName>DMASR</displayName>
					<description>Ethernet DMA status register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TS</name>
							<description>Transmit status</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TPSS</name>
							<description>Transmit process stopped
              status							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TBUS</name>
							<description>Transmit buffer unavailable
              status							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TJTS</name>
							<description>Transmit jabber timeout
              status							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ROS</name>
							<description>Receive overflow status</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TUS</name>
							<description>Transmit underflow status</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RS</name>
							<description>Receive status</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RBUS</name>
							<description>Receive buffer unavailable
              status							</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RPSS</name>
							<description>Receive process stopped
              status							</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PWTS</name>
							<description>Receive watchdog timeout
              status							</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETS</name>
							<description>Early transmit status</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PLS</name>
							<description>10MPHY Physical layer variation</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERS</name>
							<description>Early receive status</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS</name>
							<description>Abnormal interrupt summary</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NIS</name>
							<description>Normal interrupt summary</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RPS</name>
							<description>Receive process state</description>
							<bitOffset>17</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TPS</name>
							<description>Transmit process state</description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EBS</name>
							<description>Error bits status</description>
							<bitOffset>23</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MMCS</name>
							<description>MMC status</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PMTS</name>
							<description>PMT status</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTS</name>
							<description>Time stamp trigger status</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAOMR</name>
					<displayName>DMAOMR</displayName>
					<description>Ethernet DMA operation mode
          register					</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SR</name>
							<description>SR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FUGF</name>
							<description>FUGF</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FEF</name>
							<description>FEF</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ST</name>
							<description>ST</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FTF</name>
							<description>FTF</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TSF</name>
							<description>TSF</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTCEFD</name>
							<description>DTCEFD</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAIER</name>
					<displayName>DMAIER</displayName>
					<description>Ethernet DMA interrupt enable
          register					</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TIE</name>
							<description>Transmit interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TPSIE</name>
							<description>Transmit process stopped interrupt
              enable							</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TBUIE</name>
							<description>Transmit buffer unavailable interrupt
              enable							</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TJTIE</name>
							<description>Transmit jabber timeout interrupt
              enable							</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ROIE</name>
							<description>Overflow interrupt enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TUIE</name>
							<description>Underflow interrupt enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RIE</name>
							<description>Receive interrupt enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RBUIE</name>
							<description>Receive buffer unavailable interrupt
              enable							</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RPSIE</name>
							<description>Receive process stopped interrupt
              enable							</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RWTIE</name>
							<description>receive watchdog timeout interrupt
              enable							</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETIE</name>
							<description>Early transmit interrupt
              enable							</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLE</name>
							<description>10M Physical layer connection</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ERS</name>
							<description>Early receive interrupt
              enable							</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AISE</name>
							<description>Abnormal interrupt summary
              enable							</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NISE</name>
							<description>Normal interrupt summary
              enable							</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAMFBOCR</name>
					<displayName>DMAMFBOCR</displayName>
					<description>Ethernet DMA missed frame and buffer
          overflow counter register					</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MFC</name>
							<description>Missed frames by the
              controller							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>OMFC</name>
							<description>Overflow bit for missed frame
              counter							</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MFA</name>
							<description>Missed frames by the
              application							</description>
							<bitOffset>17</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
						<field>
							<name>OFOC</name>
							<description>Overflow bit for FIFO overflow
              counter							</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DMACHTDR</name>
					<displayName>DMACHTDR</displayName>
					<description>Ethernet DMA current host transmit
          descriptor register					</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HTDAP</name>
							<description>Host transmit descriptor address
              pointer							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DMACHRDR</name>
					<displayName>DMACHRDR</displayName>
					<description>Ethernet DMA current host receive descriptor
          register					</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HRDAP</name>
							<description>Host receive descriptor address
              pointer							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DMACHTBAR</name>
					<displayName>DMACHTBAR</displayName>
					<description>Ethernet DMA current host transmit buffer
          address register					</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HTBAP</name>
							<description>Host transmit buffer address
              pointer							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DMACHRBAR</name>
					<displayName>DMACHRBAR</displayName>
					<description>Ethernet DMA current host receive buffer
          address register					</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HRBAP</name>
							<description>Host receive buffer address
              pointer							</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
