Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup.svd
				<register>
					<name>HSEM_RX28</name>
					<displayName>HSEM_RX28</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x70</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX29</name>
					<displayName>HSEM_RX29</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x74</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX30</name>
					<displayName>HSEM_RX30</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x78</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RX31</name>
					<displayName>HSEM_RX31</displayName>
					<description>HSEM register HSEM_RX0 HSEM_RX31</description>
					<addressOffset>0x7C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX0</name>
					<displayName>HSEM_RLRX0</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x100</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX1</name>
					<displayName>HSEM_RLRX1</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x104</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX2</name>
					<displayName>HSEM_RLRX2</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x108</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX3</name>
					<displayName>HSEM_RLRX3</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x10C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX4</name>
					<displayName>HSEM_RLRX4</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x110</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX5</name>
					<displayName>HSEM_RLRX5</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x114</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX6</name>
					<displayName>HSEM_RLRX6</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x118</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX7</name>
					<displayName>HSEM_RLRX7</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x11C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX8</name>
					<displayName>HSEM_RLRX8</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x120</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX9</name>
					<displayName>HSEM_RLRX9</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x124</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX10</name>
					<displayName>HSEM_RLRX10</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x128</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX11</name>
					<displayName>HSEM_RLRX11</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x12C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX12</name>
					<displayName>HSEM_RLRX12</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x130</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX13</name>
					<displayName>HSEM_RLRX13</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x134</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX14</name>
					<displayName>HSEM_RLRX14</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x138</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX15</name>
					<displayName>HSEM_RLRX15</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x13C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX16</name>
					<displayName>HSEM_RLRX16</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x140</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX17</name>
					<displayName>HSEM_RLRX17</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x144</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX18</name>
					<displayName>HSEM_RLRX18</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x148</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX19</name>
					<displayName>HSEM_RLRX19</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x14C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX20</name>
					<displayName>HSEM_RLRX20</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x150</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX21</name>
					<displayName>HSEM_RLRX21</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x154</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX22</name>
					<displayName>HSEM_RLRX22</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x158</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX23</name>
					<displayName>HSEM_RLRX23</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x15C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HSEM_RLRX24</name>
					<displayName>HSEM_RLRX24</displayName>
					<description>HSEM Read lock register</description>
					<addressOffset>0x160</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID</name>
							<description>Semaphore ProcessID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CID</name>
							<description>Semaphore CID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock indication</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
