Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx_backup.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PFIC</name>
			<description>Programmable Fast Interrupt
      Controller			</description>
			<groupName>PFIC</groupName>
			<baseAddress>0xE000E000</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>ISR1</name>
					<displayName>ISR1</displayName>
					<description>Interrupt Status
          Register					</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000000C</resetValue>
					<fields>
						<field>
							<name>INTENSTA2_3</name>
							<description>Interrupt ID Status</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>INTENSTA5</name>
							<description>Interrupt ID Status</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>INTENSTA8_9</name>
							<description>Interrupt ID Status</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>INTENSTA12_31</name>
							<description>Interrupt ID Status</description>
							<bitOffset>12</bitOffset>
							<bitWidth>20</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ISR2</name>
					<displayName>ISR2</displayName>
					<description>Interrupt Status
          Register					</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INTENSTA</name>
							<description>Interrupt ID Status</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ISR3</name>
					<displayName>ISR3</displayName>
					<description>Interrupt Status
          Register					</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INTENSTA</name>
							<description>Interrupt ID Status</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ISR4</name>
					<displayName>ISR4</displayName>
					<description>Interrupt Status
          Register					</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INTENSTA</name>
							<description>Interrupt ID Status</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ISR5</name>
					<displayName>ISR5</displayName>
					<description>Interrupt Status
          Register					</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INTENSTA</name>
							<description>Interrupt ID Status</description>
							<bitOffset>0</bitOffset>
							<bitWidth>20</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPR1</name>
					<displayName>IPR1</displayName>
					<description>Interrupt Pending Register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PENDSTA2_3</name>
							<description>PENDSTA</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PENDSTA5</name>
							<description>PENDSTA</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>INTENSTA8_9</name>
							<description>PENDSTA</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>INTENSTA12_31</name>
							<description>PENDSTA</description>
							<bitOffset>12</bitOffset>
							<bitWidth>20</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPR2</name>
					<displayName>IPR2</displayName>
					<description>Interrupt Pending Register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PENDSTA</name>
							<description>PENDSTA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPR3</name>
					<displayName>IPR3</displayName>
					<description>Interrupt Pending Register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PENDSTA</name>
							<description>PENDSTA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPR4</name>
					<displayName>IPR4</displayName>
					<description>Interrupt Pending Register</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PENDSTA</name>
							<description>PENDSTA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPR5</name>
					<displayName>IPR5</displayName>
					<description>Interrupt Pending Register</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PENDSTA</name>
							<description>PENDSTA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>20</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ITHRESDR</name>
					<displayName>ITHRESDR</displayName>
					<description>Interrupt Priority
          Register					</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>THRESHOLD</name>
							<description>THRESHOLD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGR</name>
					<displayName>CFGR</displayName>
					<description>Interrupt configuration register</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SYSRST</name>
							<description>System reset register</description>
							<access>write-only</access>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>KEYCODE</name>
							<description>KEYCODE</description>
							<access>write-only</access>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GISR</name>
					<displayName>GISR</displayName>
					<description>Interrupt Global Register</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>NESTSTA</name>
							<description>interrupt nesting</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>GACTSTA</name>
							<description>interrupt execution</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPENDSTA</name>
							<description>interrupt pending</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GLOBL_IE</name>
							<description>global interrupt enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_MODE</name>
							<description>debug mode</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LOCK_UP</name>
							<description>lock-out state</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EX_STATE</name>
							<description>The kernel status register, which is used to obtain the running state of the kernel</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>VTFIDR</name>
					<displayName>VTFIDR</displayName>
					<description>ID Config Register</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VTFID0</name>
							<description>VTFID0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>VTFID1</name>
							<description>VTFID1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>VTFID2</name>
							<description>VTFID2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>VTFID3</name>
							<description>VTFID3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>VTFADDRR0</name>
					<displayName>VTFADDRR0</displayName>
					<description>Interrupt 0 address
          Register					</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VTF0EN</name>
							<description>VTF0EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADDR0</name>
							<description>ADDR0</description>
							<bitOffset>1</bitOffset>
							<bitWidth>31</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>VTFADDRR1</name>
					<displayName>VTFADDRR1</displayName>
					<description>Interrupt 1 address
          Register					</description>
					<addressOffset>0x64</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VTF1EN</name>
							<description>VTF1EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADDR1</name>
							<description>ADDR1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>31</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>VTFADDRR2</name>
					<displayName>VTFADDRR2</displayName>
					<description>Interrupt 2 address
          Register					</description>
					<addressOffset>0x68</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VTF2EN</name>
							<description>VTF2EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADDR2</name>
							<description>ADDR2</description>
							<bitOffset>1</bitOffset>
							<bitWidth>31</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>VTFADDRR3</name>
					<displayName>VTFADDRR3</displayName>
					<description>Interrupt 3 address
          Register					</description>
					<addressOffset>0x6C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VTF3EN</name>
							<description>VTF3EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADDR3</name>
							<description>ADDR3</description>
							<bitOffset>1</bitOffset>
							<bitWidth>31</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IENR1</name>
					<displayName>IENR1</displayName>
					<description>Interrupt Setting Register</description>
					<addressOffset>0x100</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INTEN12_31</name>
							<description>INTEN12_31</description>
							<bitOffset>12</bitOffset>
							<bitWidth>20</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IENR2</name>
					<displayName>IENR2</displayName>
					<description>Interrupt Setting Register</description>
					<addressOffset>0x104</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INTEN</name>
							<description>INTEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IENR3</name>
					<displayName>IENR3</displayName>
					<description>Interrupt Setting Register</description>
					<addressOffset>0x108</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INTEN</name>
							<description>INTEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IENR4</name>
					<displayName>IENR4</displayName>
					<description>Interrupt Setting Register</description>
					<addressOffset>0x10C</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INTEN</name>
							<description>INTEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IENR5</name>
					<displayName>IENR5</displayName>
					<description>Interrupt Setting Register</description>
					<addressOffset>0x110</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INTEN</name>
							<description>INTEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>20</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IRER1</name>
					<displayName>IRER1</displayName>
					<description>Interrupt Clear Register</description>
					<addressOffset>0x180</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INTRSET12_31</name>
							<description>INTRSET12_31</description>
							<bitOffset>12</bitOffset>
							<bitWidth>20</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IRER2</name>
					<displayName>IRER2</displayName>
					<description>Interrupt Clear Register</description>
					<addressOffset>0x184</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INTRSET</name>
							<description>INTRSET</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IRER3</name>
					<displayName>IRER3</displayName>
					<description>Interrupt Clear Register</description>
					<addressOffset>0x188</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INTRSET</name>
							<description>INTRSET</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IRER4</name>
					<displayName>IRER4</displayName>
					<description>Interrupt Clear Register</description>
					<addressOffset>0x18C</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INTRSET</name>
							<description>INTRSET</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IRER5</name>
					<displayName>IRER5</displayName>
					<description>Interrupt Clear Register</description>
					<addressOffset>0x190</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INTRSET</name>
							<description>INTRSET</description>
							<bitOffset>0</bitOffset>
							<bitWidth>20</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPSR1</name>
					<displayName>IPSR1</displayName>
					<description>Interrupt Pending Register</description>
					<addressOffset>0x200</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PENDSET2_3</name>
							<description>PENDSET</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PENDSET5</name>
							<description>PENDSET</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PENDSET8_9</name>
							<description>PENDSET</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PENDSET12_31</name>
							<description>PENDSET</description>
							<bitOffset>12</bitOffset>
							<bitWidth>20</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPSR2</name>
					<displayName>IPSR2</displayName>
					<description>Interrupt Pending Register</description>
					<addressOffset>0x204</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PENDSET</name>
							<description>PENDSET</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPSR3</name>
					<displayName>IPSR3</displayName>
					<description>Interrupt Pending Register</description>
					<addressOffset>0x208</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PENDSET</name>
							<description>PENDSET</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPSR4</name>
					<displayName>IPSR4</displayName>
					<description>Interrupt Pending Register</description>
					<addressOffset>0x20C</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PENDSET</name>
							<description>PENDSET</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPSR5</name>
					<displayName>IPSR5</displayName>
					<description>Interrupt Pending Register</description>
					<addressOffset>0x210</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PENDSET</name>
							<description>PENDSET</description>
							<bitOffset>0</bitOffset>
							<bitWidth>20</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPRR1</name>
					<displayName>IPRR1</displayName>
					<description>Interrupt Pending Clear Register</description>
					<addressOffset>0x280</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PENDRST2_3</name>
							<description>PENDRESET</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PENDRST5</name>
							<description>PENDRESET</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PENDRST8</name>
							<description>PENDRESET</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PENDRST12_31</name>
							<description>PENDRESET</description>
							<bitOffset>12</bitOffset>
							<bitWidth>20</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPRR2</name>
					<displayName>IPRR2</displayName>
					<description>Interrupt Pending Clear Register</description>
					<addressOffset>0x284</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PENDRST</name>
							<description>PENDRESET</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPRR3</name>
					<displayName>IPRR3</displayName>
					<description>Interrupt Pending Clear Register</description>
					<addressOffset>0x288</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PENDRST</name>
							<description>PENDRESET</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPRR4</name>
					<displayName>IPRR4</displayName>
					<description>Interrupt Pending Clear Register</description>
					<addressOffset>0x28C</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PENDRST</name>
							<description>PENDRESET</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPRR5</name>
					<displayName>IPRR5</displayName>
					<description>Interrupt Pending Clear Register</description>
					<addressOffset>0x290</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PENDRST</name>
							<description>PENDRESET</description>
							<bitOffset>0</bitOffset>
							<bitWidth>20</bitWidth>
						</field>
					</fields>
				</register>
